[{"company_name": "Prudential Financial, Inc.", "job_title": "Software Engineer", "company_location": "Roseland, NJ", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1044074&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_87e47f78&cb=1598754125945&jobListingId=3629085839", "job_description": "Software Engineer-AIT00039\n\nDescription\n\nPrudential Financial is seeking a Software Engineer for the Global Technology organization supporting our Individual Solutions Group (ISG) businesses. This candidate will work with client management to identify and specify business requirements and processes for diverse development platforms computing environments e.g. host based distributed systems client server software hardware technologies and tools. Researches and evaluates alternative solutions and recommends the most efficient and cost effective solution for the systems design. Formulates logical statements of business problems and devises tests and implements efficient cost effective application program solutions e.g. codes and or reuses existing code through the use of program development software alternatives and or integrates purchased solutions. May give some direction and guidance to other systems analysts programmers. Prepares charts tables and diagrams to assist in analyzing problems utilizing various business scientific engineering and mathematical techniques. Analyzes existing system and programming logic to provide more efficient machine operations or to identify difficulties and revises the logic and procedures involved as necessary. Performs related duties as assigned or requested. May contribute towards application availability health checks and business continuation with a sense of urgency. May also assist with incident and problem resolution. Works independently receives minimal guidance. Acts as a resource for colleagues with less experience. Solves complex problems takes a new perspective using existing solutions.\n\nQualifications\n\nPosition Overview: Prudential’s Integration Team supports Annuities and Life Insurance business in enabling integrations of system where data is migrated, broadcasted, consolidated, aggregated and correlated. The team develops various patterns (API’s Microservices Stream Processors) and technologies (APIGEE, Spring Boot, Full/MEAN Stack, Message Broker, Kafka)\n\nResponsibilities:\n\nWorking with various team in understanding business need, performing analysis and transforming them to testable components\n\nEmploy industry best practices to deliver world-class solutions. Ensure developed solutions remain compliant with all applicable Prudential standards, non-functional requirements and quality targets\n\nProvide experienced software development skills to team and coordinate with other technical leaders across the organization\n\nDrive software development activities to meet schedules and timelines\n\nThrive to ensure code quality is high supporting testing (component and integration tests) and automation\n\nResearch problems with a strong sense of ownership and develop solutions to address the problems\n\nStay abreast od emerging technologies and how they can be applied to Prudential\n\nEnable change, help accelerate innovation\n\nDemonstrating experience with taking intelligent risks and leveraging a “test and learn” mentality\n\nCommitted to a spirit of authentic partnership – to colleagues both internal and external to the organization\n\nQualifications:\n\nStrong problem-solving and analysis capabilities\n\nClear, professional communications (listening, oral and written communications)\n\nStrong relationship building and collaboration skills\n\nDemonstrated track record as a team player\n\nPreferred Qualifications:\n\nBachelor of Computer Science or Engineering or experience in related fields\n\nExperience with agile development methodologies and Test-Driven Development (TDD)\n\nExcellent problem-solving techniques\n\nAbility to work independently with minimal guidance\n\nExperience working on agile scrum teams or under a SAFe@ framework\n\nA successful candidate will possess 5+ years of experience with the following:\n\nWorking knowledge of branching techniques and usage of Github or Bitbucket\n\nExperience in distributed systems, object-oriented programming, design patterns and design methodology\n\nExposure to Kafka or a stream processor platform, desired but not required\n\nExperience deploying applications to AWS, ECS, EC2 instances. Working knowledge of AWS Services such as Cloudwatch, CodeDeploy.\n\nExperience with FULL/MEAN STACK a strong plus\n\nExperience implementing service-oriented architecture (SOA) patterns\n\nExperience with Web service technologies such as REST, JSON, SOAP, XML, JDBC, MySQL\n\nExperience in JAVA/J2EE services using Spring Boot, Spring CLI, Maven, Microservice, multi-threading, Concurrency and parallel processing\n\nExposure to monitoring and logging techniques\n\nKnowledge working with MongoDB or similar NoSQL database\n\nMessage Broker, desired but not required\n\nKnowledge of Annuities and Insurance products a plus\n\nPrudential is a multinational financial services leader with operations in the United States Asia Europe and Latin America. Leveraging its heritage of life insurance and asset management expertise Prudential is focused on helping individual and institutional customers grow and protect their wealth. The company’s well-known Rock symbol is an icon of strength stability expertise and innovation that has stood the test of time. Prudential's businesses offer a variety of products and services including life insurance annuities retirement-related services mutual funds asset management and real estate services. For more information please visit www.prudential.com.\n\nPrudential is not accepting unsolicited resumes from search firms for this open position unless contracted with Staffing. Agencies must work with Staffing as the primary point of contact and follow the Prudential application process to be considered for business. All resumes submitted by search firms to any employee at Prudential via-email Internet or directly to hiring managers in any form without a valid written search agreement in place for that position will be deemed the sole property of Prudential and no fee will be paid in the event the candidate is hired by Prudential.\n\nNote: Any search agreement entered into with Prudential before January 2004 is null and void. Search firms are essential to the recruitment and staffing efforts at Prudential and we value the partnerships we have built with our preferred vendors. Prudential has established and regularly maintains a preferred vendor list and even preferred vendors need to have a written search agreement signed by the Director Recruiting Programs Staffing at Prudential in place for the specific position in order for a fee to be paid for any candidate referrals.\n\nJob Function Software/System Development\n\nPrimary Location United States-New Jersey-Roseland\n\nSchedule Full-time\n\nTravel No"}, {"company_name": "OpenSlate", "job_title": "Software Engineer (Python)", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1056690&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_fd803eef&cb=1598754125951&jobListingId=2859389479", "job_description": "AddThis Sharing ButtonsShare to FacebookFacebookFacebookShare to TwitterTwitterTwitterShare to LinkedInLinkedInLinkedIn\nWe’re looking for experienced Python engineers who would enjoy the challenge of designing and building applications to provide insights into a highly dynamic and expansive data set. Working with user-generated content at scale poses some unique problems so we highly value creative technical minds that can imagine solutions and bring them to reality.\n\nResponsibilities:\n\nDesigning and building scalable systems that can collect, store, retrieve and transform data coming from a variety of different sources including APIs, Postgres, Solr, S3 and Cassandra.\nDesigning and implementing maintainable API’s that support our end-user applications.\nSelecting appropriate data storage and retrieval methods and technologies.\nDesigning data-structures and optimizing queries that deal with millions of rows of data.\nCreating reusable and maintainable code, automated tests and clear documentation.\nOptimizing your code to run in a high-performance real-time environment that generates billions of events a day.\nSupporting the software and systems you write and deploy in our production environment.\nCollaborating across engineering, product and data teams to solve technical and business issues.\n\nAbout You:\n\n5+ years experience building non-trivial, data-centric python applications and API’s in a Linux environment\nExperience designing and implementing scalable systems processing large amounts of data\n2+ years building back-end services and APIs in Django or Flask\nThorough understanding of common internet networking technologies, including TCP, HTTP, DNS.\nExpertise working with RDBMS, including schema design, writing SQL for complex multi-table queries and optimizing query performance\nExpertise in using Git and Git branching models\nYou enjoy working as a part of a collaborative team and demonstrate an open mindset.\nStrong communication skills: able to clearly articulate, defend and document design decisions and work with a cross-discipline team\nA love of problem-solving and a sense of imagination\n\nAddThis Sharing ButtonsShare to FacebookFacebookFacebookShare to TwitterTwitterTwitterShare to LinkedInLinkedInLinkedIn\n"}, {"company_name": "MongoDB, Inc. formerly 10gen, Inc.", "job_title": "Software Engineer, Cloud Services, IAM", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=153358&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_818d2349&cb=1598754125959&jobListingId=3649570781", "job_description": "The MongoDB Cloud Services Team is a diverse collection of individuals working together to help our users run MongoDB in the Cloud at global scale. The Cloud Team is responsible for MongoDB Atlas - our database as a service offering and fastest growing product. MongoDB Atlas allows users to deploy fault-tolerant, globally distributed MongoDB clusters in just minutes.\n\nWe're seeking a Full-Stack Engineer to join the Cloud IAM (Identity and Access Management) team, which is part of the Cloud Core Engineering team. The IAM team's mission is to provide the foundation that forms the basis of an Atlas customer's experience. On the front-end, our work touches every part of the user interface, including registration, login, organization and project administration, and the entire navigation framework. On the back-end, our authentication and authorization framework is responsible for processing every single HTTP request made by the UI and the public API, along with maintaining our alerts processing framework such that it scales for all of our customers.\n\nWe're looking for someone who\n\nHas at least 3 years of professional experience building full-stack web applications\nHas extensive experience developing backend systems (Java, C#, Go, Node.js, etc.)\nHas extensive experience with a modern JavaScript environment\nIs eager to solve tough problems in a distributed systems environment\nHas excellent communication skills, both written and verbal\nIs curious, collaborative, empathetic, and intellectually honest\n\nResponsibilities\n\nLead medium to large sized projects from specification to delivery\nCollaborate with team members to develop and mature our best practices and core concepts\nSelf-manage your project and non-project work, maintaining the balance between accomplishing goals with research & development\nOwn our core values and adhere to them in your work\n\nTechnologies we use\n\nMongoDB\nJava 11\nJetty, Jackson, Guice, Bazel\nJavaScript, TypeScript\nReact, Redux, Emotion, Webpack, Backbone.js\n\nSuccess Measures\n\nA Full Stack Engineer will be successful in this role when they:\n\n\nAre willing to learn and contribute to all parts of the stack\nAre open, honest, and willing to contribute and collaborate with others\nDevelop confidence in finding their way across the platform\nCan take responsibility for the planning and execution of a major feature, representing Engineering when working with Product Design\nAre resolute in their approach to problem solving, balancing the needs of their team with the willingness to get to the bottom of issues\n\nGreat things about working with us\n\nFully catered lunch twice a week\nEmployee affinity groups for under-represented minorities in tech\nPremium trans-inclusive healthcare, including out of network coverage, dental, and vision\nYearly conference budget for interacting with the latest technologies we use daily\n\n*MongoDB, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.*"}, {"company_name": "Thrive Global Holdings, LLC", "job_title": "Platform Engineer (NY)", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=978188&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_67dc00ba&cb=1598754125958&jobListingId=3582963944", "job_description": "About this role:Thrive Global is the leading behavior change technology company helping individuals and companies reach peak performance, ultimately ending the stress and burnout epidemic. We’re leading the global conversation about well-being and performance and creating tools and programs that help people go from knowing what to do to actually doing it.As a Platform Engineer, you will play a significant role in building and operating Thrive’s core behavior change platform services. We’re looking for someone with a bias for action, who’s comfortable working at a fast pace and can work with sometimes-ambiguous requirements. At Thrive, you will provide thought leadership on architecting and implementing highly available services that will serve as the foundation for our platform as we scale.Examples of the projects you’ll be working on:Working with the Infrastructure and Operations team to establish our first containerized server applications running on a service mesh.Designing and developing B2B SaaS-driven core platform services that provide data isolation, customer-specific configuration, and the like.Being a driving force behind our adoption of monitoring and alerting technologies to ensure we have a high-uptime product.Building out a platform messaging/”nudge” service that drives behavior change by triggering and delivering millions of messages per month.Designing and developing platform sensor and platform Integration services that leverage IoT and other types of integrationsAbout you:A very strong programmer, with strong fundamentals and proficiency in software design and architecture.A DevOps mindset and approach, with the ability to prototype and evolve new backend services from the ground up.Experience with modern cloud-native runtime platforms and tech.Solid knowledge of cloud infrastructure, and comfortable with multiple deployment patterns (monoliths, microservices, containers, and serverless).Excellent written and oral communication, with the ability to write and maintain excellent documentation.Self-sufficient: You get stuff done, you are able to work with little direct supervision but know when to ask for help.Strong Collaborator: You have demonstrated the ability to work in a team environment, as a leader and member. You get excited to work closely with teams outside of Platform on projects, including other engineering teams, product, design, QA and more.Strong desire to work in a startup environment that includes rapid release, quick and reliable decision making, and a high degree of autonomy.What we offer:Being part of a mission­-driven company that’s truly making a difference in the lives of people around the world ­Ability to develop within the company and shape our growth strategyA human-centric culture with a range of wellness perks and benefitsA competitive compensation packageMedical, dental and vision coverage + 401k program with company matchGenerous paid time-off programsOur MissionThrive Global’s mission is to end the stress and burnout epidemic by offering companies and individuals sustainable, science-based solutions to enhance well-being, performance, and purpose, and create a healthier relationship with technology. Recent science has shown that the pervasive belief that burnout is the price we must pay for success is a delusion. We know, instead, that when we prioritize our well-being, our decision-making, creativity, and productivity improve dramatically. Thrive Global is committed to accelerating the culture shift that allows people to reclaim their lives and move from merely surviving to thriving. "}, {"company_name": "Ribbon Home, Inc.", "job_title": "Full-Stack Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=921035&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_72a56826&cb=1598754125949&jobListingId=3380280315", "job_description": "\n\nWho are we?Ribbon is a first of its kind real estate technology company transforming the real estate transaction by delivering certainty, transparency and joy to the home buying process. Consumers and realtors deserve a better experience, and we have designed an open platform that welcomes everyone in the ecosystem to participate.\n\nAs members of the Ribbon team, we live out our mission every day through our core values:\n\n\nBe an invited guest to dinner - Everything we do is in the service of the customer.\nBe a (home) owner - If we see a problem, we address it head on without assuming someone else will do it.\nBreak new ground - We challenge conventional wisdom to create clever solutions and break down the walls.\nFoster greatness - We grow and inspire the team around us to constantly make Ribbon better.\nEngage with intellectual humility - We become our best selves through rigorous debate and adjusting opinions based on new information.\n\nHow you'll help make homeownership achievable:\n\n\n\nBuild and shape our web application architecture\nWork with world-class engineers to build an impactful product\nUnderstand customers to figure out what we should be building and how we should build it\n\n\n\n\nWhat we're looking for:\n\n\nProduct thinking - The ability to think about what we're building from the customer point of view. To build the best products, the engineering team must empathize and build products with the customer in mind.\nCraftsmanship - You care about writing well-structured code and building great software. You understand the trade-offs when we have to move faster, but you prioritize writing clean code with the right abstractions.\nFull stack - Comfortable moving up and down the stack. It matters less that you know the exact frameworks and tools that we use, but more that you are willing and able to learn.\n\n\n\nYou have:\n\n\nAt least two years in a full-stack production environment\nExperience with a modern frontend framework and a backend MVC framework\nMade significant technological decisions and stuck around to deal with the consequences\n\nWhat we offer:\n\n\n\nHealth, dental, and vision insurance\nFlexible, unlimited vacation\nRegular team lunches\nDiscounted fitness benefits\n401(k)\nCommuter benefits\nFSA + HSA\nLearning + development stipend\nMeaningful equity in the company\n\nInterested? Read more about our engineering culture here!\n\nEven if you don't meet all the requirements, we encourage you to apply! If you'd be excited to show up for work each day, we'd be excited to have you on our team.\n\nHere at Ribbon we're not scared of differences. It's how we break new ground. As we scale and we help families from every walk of life, the team we build must be reflective of the diversity that we serve. Together, we've built and will continue to grow, a diverse and inclusive culture where everyone has a seat at the table and the space to be their most authentic self. Ribbon is an Equal Opportunity Employer and we support, celebrate, and cherish all the things that make our teammates who they are.\n"}, {"company_name": "Sapphire Digital", "job_title": "Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=880621&s=149&guid=000001743d2bf582b097a92b919cc8d7&src=GD_JOB_AD&t=SRFJ&vt=w&cs=1_762a2750&cb=1598754125945&jobListingId=3550581281", "job_description": "Sapphire Digital is looking for a full-stack junior / mid-level developer to expand our New York or Tulsa, OK engineering teams. We follow an Agile methodology in small software teams to consistently deliver high-quality software. Our stack includes Ruby, Rails, Angular, TypeScript, Node, Rabbit, Solr, Postgres, Redis, Puppet, and Hubot. Our infrastructure is declared as code and provisioned on AWS. What we offer is mentorship, career guidance, a competitive salary, remote-friendly workspace, continuing education support (conferences, books, online resources) with offices in New York, NY, Tulsa, OK and Lyndhurst, NJ\n\nIn this position, you'll be responsible for:\n\n\nDeveloping new full-stack features to improve our CareSelect product.\nSupporting and enhancing current systems.\nDebugging and optimizing code.\nSupporting the development of documentation and tests.\nBuilding tooling to improve our operational efficiency.\nMentoring others on the established practices and patterns used by the team.\n\nYou might be a good fit if you have:\n\n\nsoftware development experience required.\nExperience with Ruby on Rails or Angular/TypeScript. Experience with both a strong plus.\nFamiliarity using Git, HTML, CSS, and JavaScript.\nExcellent communication skills.\nA collaborative spirit, and you enjoy working with a team to build things.\nA desire to continually improve, and you value giving and receiving constant and constructive feedback.\nA deliberate approach to software development, guided by automated testing and short feedback cycles.\nAn owner's mindset, taking ownership of not only your work throughout the software development life-cycle, but continually looking for ways to improve the entire product.\n"}, {"company_name": "Freed Maxick & Battaglia", "job_title": "Systems Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1067796&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_62fd0d06&cb=1598754125954&jobListingId=3493991350", "job_description": "\nSystems EngineerFreed Maxick CPAs, P.C. has an immediate opportunity in our downtown Buffalo office for a Systems Engineer (Network and Virtualization). This resource, reporting to the Lead Systems Architect, fills a role that is technical with collaborative and leadership components.\n\nPosition Responsibilities:\n\nThe Systems Engineer (Network and Virtualization) is responsible for managing and maintaining physical network and VMware infrastructure. The primary responsibility is working within our engineering team to complete ongoing hardware/software maintenance, capacity planning, monitoring and control of network and virtualization resources.\n\nOther responsibilities include:\n\nDemonstrating leadership and advanced knowledge of Virtualization Technology and Networking fundamentals.\nEnsuring the stability, integrity and efficient operation of the firm’s technology infrastructure through the appropriate operation of technologies.\nTroubleshooting and resolving networking, storage, and compute issues; act as an escalation point for internal service desk.\nAbility to work within a team and provide leadership in the design, deployment and support of infrastructure systems focused on best practices and repeatable standardized processes.\nFully documenting all created design, deployment and support processes including capacity planning, recovery strategies and security for supported areas while establishing system management criteria.\nIdentifying and recommending upgrades and enhancements that would contribute to system availability, cost savings, and/or productivity improvements.\nPerforming responsibilities in accordance with all firm standards, policies and procedures.\n\nPosition Requirements:\n\nAssociates Degree or higher in Computer Information Systems, Business Administration or related field, or equivalent applicable work experience.\n5+ years’ experience of highly relevant Virtualization and Network engineering.\nExperience with VMware technologies (ESXi, vSAN, Horizon, NSX, Velocloud, etc.)\nExperience with Cisco/Meraki Networking technologies (Switches, Wireless, Routers, Security, UC, etc.)\nKnowledge of computer and/or network security systems, applications, procedures and techniques.\nUnderstanding of Cloud technologies such as IaaS, PaaS, SDN, NFV, and other emerging technologies.\nAbility to identify and resolve computer system malfunctions and operations problems.\nAbility to communicate technical information to nontechnical personnel.\nAbility to communicate clearly and effectively with staff, vendors and peers.\nStrong attention to detail and solid follow-up capabilities.\nWillingness to work a flexible schedule.\nSkill in organizing resources and establishing priorities.\nExcellent verbal and written communication skills.\nAbility to learn and support new systems and applications.\nCertification or certification level knowledge for CCNA or VCP preferred.\nSome inter-office travel may be required.\n\nThe ideal candidate should have a thorough understanding of network and virtualization technology fundamentals, with prior experience both designing and deploying systems, is motivated, detail-oriented, highly organized and able to handle a variety of tasks and responsibilities in an efficient manner with a high level of quality.\n\nSend cover letter, resume and salary requirements to career@freedmaxick.com.\n\neoeSend cover letter, resume and salary requirements\n\nto career@freedmaxick.com.\n\nApply Online\n"}, {"company_name": "Red Balloon Security, Inc.", "job_title": "Software Development Test Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=860455&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_8eabb337&cb=1598754125947&jobListingId=3091278080", "job_description": "Job Description  As a Software Development Engineer in Test, you would join a team of security researchers and software developers. Your role would be dedicated to test and validate Red Balloon Security’s embedded security solution. You would be a part of verifying cutting edge embedded security software used in devices across a range of industries.  Responsibilities  • Lead and engage with engineering team to improve software development production and release speed  • Develop the engineering team’s test coverage by defining testing setup and metrics; designing test cases and procedures; and documenting the testing results  • Increase the automation of tasks and expand test coverage through both new and existing infrastructure  • Write and debug test cases, as well as analyze and review testing results  Required Education, Experience, Skills  • BS/BA in Computer Science, Computer Engineering, or similar technical field of study or equivalent practical experience  • At least 2 years of professional work experience in continuous integration testing  • Strong attention to detail, an ability to multitask, and an ability to work independently and on a team  • Must be passionate about testing and validating an embedded product  This is a full-time, in office position. VISA sponsorship is available for this position.  Company Description  Red Balloon Security is a leading security provider and research firm for embedded devices across all industries. Founded in 2011 by Dr. Ang Cui, the company's core technology, Symbiote Defense, was originally developed within Columbia University's Intrusion Detection Systems Lab. Red Balloon Security’s pioneering R&D is led by a team of world-class academic researchers and developers who have published seminal research papers in the fields of embedded security and intrusion detection, led US Department of Defense funded research activities, ethically disclosed vulnerabilities within hundreds of millions of ubiquitous embedded devices and worked as embedded security researchers within various intelligence agencies."}, {"company_name": "Orion Advisor Technology", "job_title": "Enterprise Application Developer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=859002&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_da986cbe&cb=1598754125952&jobListingId=3646875205", "job_description": "The Enterprise Applications Architect is responsible for building and maintaining software that is cross cutting in nature, and supports multiple development teams. This position will utilize the system development life cycle to ensure delivery of concise, well tested, well thought out, and usable projects completed in a timely manner.Essential Functions of the Job\n\nCreates solutions to business problems and refines features into user stories.Guides new architectural ideas and implementations.Designs, develops, tests and deploys applications by writing new code and improving existing code ensuring applications work properly.Provides support for design, development and implementation of application development projects.Understands and uses best practices and standard guidance.Understands and debugs different tiers of the application, UI, API, and database.Able to create and modify routine, low impact code.Troubleshoots and debugs system inefficiencies.Assists in maintaining databases accuracy and stability.Identifies and troubleshoots issues with various sites or programming code and fix any resulting problems.Secures applications against hacking vulnerabilities.Maintains a high level of technical knowledge in all applicable programming languages and database formats.Mentors other developers while acting as a resource for input and advice.Identifies and fixes resource bottlenecks.\n\nSkills Needed to Perform the Job\n\nKnowledge of investment advisory business.Ability to creatively and efficiently find solutions to the companies on going issues.Ability to multi-task while maintaining careful attention to detail.Ability to work effectively both individually and within a team environment.Ability to work with a sense of urgency to meet deadlines and address competing priorities.Proficient skills with Microsoft Office software including Word, Excel, PowerPoint and Outlook.Effective written, listening and verbal communication skills.Effective problem solving and organizational skills.\n\n#LI - RA1"}, {"company_name": "Tapad, Inc.", "job_title": "Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=880655&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_cdc8fff0&cb=1598754125960&jobListingId=3631178133", "job_description": "**COVID-19 UPDATE: The NYC office will remain closed until we feel it is safe to return. All interviews will be virtual until further notice.**\n\nSmall Teams; Big Data\n\nAt Tapad, we look for individuals who are motivated by complex and challenging work. We want to work with people who share compelling solutions to those challenges, solutions informed by their unique experiences, passions, and expertise.\n\nWe are looking for a Software Engineer to join our global engineering team in New York City. We need a person who can work hands-on as an engineer, solving complex problems and building advanced software systems. We face daily challenges that are both unique and engaging, while processing data at petabyte scale. That is over one trillion data points in any given 60-day period — with consumer privacy and data security at the heart of everything we do.\n\nThe size and scale of our challenges demand the use of cutting edge, open-source technologies, like Apache Spark, Apache Beam, and Kubernetes. We're proud to have been built on Scala from day one.\n\nCollaboration is at the forefront of our day-to-day at Tapad. You would be working with multiple engineering domains, and with our commercial teams, to guarantee that we are delivering the best products. We believe that our engineers have an obligation to dissent and discuss. A successful Tapad engineer understands that their ideas hold weight, and they contribute freely and regularly. We want someone who is motivated to find large-scale solutions with us. We work with big data on small teams. Every contribution is important.\n\nWhen you work with us, you matter. We ask our employees to make an impact and feel it is only right to give a lot in return. We offer every employee a generous pension plan, along with comprehensive occupational, health, and travel insurance plans, and a mobile phone stipend. We believe if you're sick, feel like you're getting sick, or just need a personal day, take that time to get better. We love to develop a sense of community, so we host meetups, share knowledge, and have regular team outings. At Tapad, we make sure our office is full of individuals who can teach and learn from one another.\n\nTechnologies we use at Tapad (don't worry, we'll teach you):\n\nGoogle Cloud Platform (GCP), Google Dataflow/Beam, SQL, BigQuery\nScala, sbt, cats, http4s, fs2\nSpark ML, TensorFlow, Kubeflow, Python, PyTorch\nAirflow, Prometheus, Kubernetes\n\nWe are looking for candidates who meet some of the following qualifications:\n\n3+ years of software engineering\nStrong understanding of algorithms and data structures in knowing when to apply them\nDeep familiarity with one or more programming languages (Ex: Scala, Java, Python, etc.)\nExperience working with high scale systems\nAbility to work with SQL\nInterested in data engineering and warehousing to develop ingestion engines, ETL pipelines, and organizing the data to expose it in a consumable format\nPassionate about agile/lean/simple\n\nBonus Experience:\n\nExperience with functional programming\nStrong understanding of concurrent and parallel programming\nKnowledge of RESTful Web services\nExperience with machine learning, including Kubeflow and TensorFlow\n\nA day in the life as an Engineer:\n\nSolve complex problems building advanced software systems, while processing several petabytes of data\nAdapt quickly to utilize software engineering best practices\nDemonstrate the ability to deliver quality software collaboratively\nDesigning, implementing, and running big data pipelines that canvas over petabytes of data\nContributing to real production projects that constitute Tapad's core offering\nCollaborate with your team of engineers, and add to product, account, and business development functions to create new products and features\nLearn functional programming\nEnsure that the software you create is testable and tested\n\n Tapad Perks:\n\nGenerous PTO - no accruing necessary\n401k matching\nOn-site medical clinic (we bring the doctor in-house so you can make appointments at your convenience)\nScala School (we'll teach you!), Coursera, LinkedIn learning, peer-lead professional development, and an abundance of resources to help you stay sharp\nUnlimited snacks and beverages\nCollaboration catered lunches\nDiscounts on gym memberships\nFoosball, ping pong, diversity and inclusion group, book club, Tough Mudder, push-up challenges, and tons of other extra-curricular activities that will make you feel like part of the Tapad family\nCheck out our #TapadLife page to see what our employees have to say\nFind more about our engineering blog HERE\n\nAbout Tapad:\n\nFounded in 2010, Tapad cracked the code on cross-device marketing technology. Our groundbreaking, proprietary technology assimilates trillions of data points to find the relationship between smartphones, desktops, laptops, tablets, connected TVs, and gaming consoles. Ten years later, we are processing data at petabyte scale, with an engineering team that comprises roughly half of our entire organization. When you work with us, you matter, and your work matters.\n\nWe use Scala, in combination with large-scale data processing and open-source technologies, to build our device graph. Across our engineering teams, we also use Scala, GCP, Spark, Kubernetes, Python, TypeScript, Angular, and anything else that helps us get the job done. We're open-minded about new technologies, we're passionate about what we do, and we make time for everyone to learn and grow as the industry changes. Engineers at Tapad are approachable and ambitious people who think outside the box and solve big problems collaboratively. Are you up for the challenge?\n\nTapad is proud to be an equal opportunity employer and will consider all qualified applicants regardless of age, sex, race, religion, national origin, sexual orientation, gender identity, marital or family status, disability, or any other legally protected status.\n\nTapad does not accept resumes from unsolicited search firms nor recruiters. In no event shall fees be paid to any unsolicited search firms nor recruiters, regardless of whether the candidate is made an offer or accepts a placement at Tapad. All resumes received through any channels will be considered the sole property of Tapad.\n\nTapad's Talent Team is solely responsible for making the decision on forming partnerships with search firms and third-party recruiters. Any communication outside Tapad's Talent team will not be an agreement of services."}, {"company_name": "Conductor, Inc.", "job_title": "Data Engineer (Python)", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=986497&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_de7a28b9&cb=1598754125961&jobListingId=3380694219", "job_description": "\n\nWhat we're looking for\n\nWe are looking for a motivated data engineer who is passionate about building reliable and scalable data pipelines to make data sets available for analysis. The ideal candidate is entrepreneurial, motivated to grow, and has a passion for Python development.\n\nOur Engineering Values\n\nCollaboration: We believe that engineers do their best work when working together in cohesive teams.\nExcellence: We believe in doing things the \"right way\" rather than the \"fast way\", and holding ourselves to a high standard of excellence.\nGrowth: We believe engineers do their best work when they are constantly growing, learning, and changing.\nCommunication: We believe in combining empathy with openness and honesty to set clear expectations and hold each other accountable.\nImpact: We believe we're making the world a better place by empowering marketers to really help their customers rather than just sell stuff.\n\n\nWhat you'll be doing\n\nDeveloping and enhancing multiple ETL pipelines\nDesigning and implementing data storage structures and ETL pipelines, keeping long-term impacts in mind\nAssemble large, complex data sets that meet functional / non-functional business requirements.\nWorking knowledge of message queuing, stream processing, and highly scalable 'big data' data stores.\nStrong project management and organizational skills.\nIdentifying and improving upon current internal processes through automation and optimization\n\n\nWho you are:\n\n\n\nBachelor's degree in Computer Science, Mathematics, or related field/equivalent experience\n3+ years of experience with Python, Java, Scala, R, Go or similar language\n3+ years of experience in working with cloud computing technology (AWS, Google Cloud Platform, etc.)\n3+ years experience working on data warehouse systems such as Snowflake\nHave developed systems based on key principles (consistency and availability, liveness and safety, durability, reliability, fault-tolerance, consensus algorithms)\nComfortable using version control and working in a collaborative environment\nExperienced with CI/CD tools for testing and deployment\nSelf-starter with the ability to work independently or in a team\nAble to manage one's schedule and prioritize tasks independently\n\n\nWhy You Should JoinAt Conductor, we are looking for engaged and passionate engineers that can raise the bar. There is a tremendous opportunity here to have immediate impact in the day-to-day and affect the company's success and growth. We all share in the same values and push each other to meet these standards.\n\nWe are made up of a diverse group of people from all backgrounds and include a team of exceptional engineers in Kyiv as well. Wherever you are from, you will find a common ground here for continuing to push forward your career and make a difference in this industry.\n\nConductor, Inc. is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nAbout ConductorConductor's search and content intelligence platform helps marketers create and optimize content to improve visibility online.\n\nThe technology generates customer intent insights that lead to compelling content, increased traffic, and higher organic marketing ROI. Customizable dashboards and workflows guide marketers through the content creation process, empowering them to measure, refine, and demonstrate the effectiveness of their SEO and content marketing efforts.\n\nIn addition to its SaaS platform, Conductor offers a suite of services and support including site audits, site migrations, and managed services that empower in-house marketing teams and digital marketing agencies to drive results and put their customers' needs first.\n\nConductor's forward-thinking customers include global and emerging enterprise brands like Citibank, Salesforce, ClassPass, and WeWork.\n\n\n"}, {"company_name": "PAIGE.AI, Inc", "job_title": "Software Engineer, AI", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=934940&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_ab413bf3&cb=1598754125956&jobListingId=3610253650", "job_description": "Paige is on a mission to accelerate and transform the diagnosis and treatment of cancer. Paige is creating a digital platform for pathologists to transform their workflow and is developing a new class of computational diagnostics positioned to drive the future of pathology.\n\nA career at Paige is deeply mission-driven where you will work with state-of-the-art technologies alongside leaders in the field and to improve cancer care every day. We reach high, help each other succeed, and believe in creativity, curiosity, and creating amazing products.\n\nPaige employees receive great benefits, including health insurance, 401(k), paid parental leave, a generous health and wellness stipend and snacks delivered to your door on a weekly basis. We recently raised $70M in series B investment to ensure we're able to continue our mission and expand our impact. Join us!\n\nWe're seeking a Software Engineer, AI to join us. In this role you'll join a team of world-leading experts in machine learning, computer vision and pathology. You'll be part of the team that builds solutions for pathologists, clinicians and researchers to accelerate and improve the accuracy of cancer detection, classification and staging. This is an extraordinary opportunity to be part of a high-performing team and to pursue a life-changing mission.\n\nKey responsibilities:\n\nDevelop machine learning tooling and infrastructure to improve the scale and efficiency of machine learning development.\nWork closely with scientists as well as engineers to support planning, developing, training and testing machine learning models for the purposes of computational pathology while leveraging and championing software engineering best practices.\nContribute to the whole product development life cycle from high uncertainty research and experimentation to deployment in production and maintenance.\n\nRequirements:\n\nVery strong Python proficiency.\nExperience working in a team implementing and evaluating deep neural networks, especially for computer vision tasks.\nExperience with Machine learning development tooling.\nExperience with modern product development practices, including software testing (e.g. unit testing, regression testing).\nExperience with Agile development methodologies.\nExperience with parallelization, threading and concurrency problems.\nExperience with design patterns, algorithms and data structures.\nExperience with distributed systems.\n\nMinimum qualifications:\n\nMaster's degree in computer science or a related field, or equivalent years of experience\n3+ years of industry experience as a software engineer\n"}, {"company_name": "Neglia Engineering Associates", "job_title": "Professional Civil Engineer", "company_location": "Lyndhurst, NJ", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1044077&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_9be6b6aa&cb=1598754125945&jobListingId=3629113450", "job_description": "NEA is looking for talented, energetic and self-motivated employees with good communication skills for the following positions in our Lyndhurst and/or Mountainside, NJ Office. NEA is a family owned, diversified, and versatile engineering firm that specializes in both municipal and private clientele. This diversification and versatility offer our employees an unprecedented opportunity to succeed at all times. Neglia Engineering Associates is a well-established full-service organization. Although NEA is a family owned mid-size firm, we take pride in offering our clients state-of-the-art services--as we maintain the down-to-earth, eager-to-please attributes that provided the very foundation of our success.\n\nSince our founding more than half-century ago, we have amassed a wealth of practical and technical experience in the fields of civil and environmental engineering, municipal engineering, traffic engineering, surveying, landscape architectural, construction management, GIS-mapping and planning.\n\n\n\nProfessional Civil Engineer*\n\n\nExperience and Requirements\n\n· Bachelors from an accredited school of Civil Engineering.\n\n· Professional Engineer’s License in good standing.\n\n· 4+ years of experience in Land Development and Municipal Engineering.\n\n· Candidate should possess good communication, verbal, and technical writing skills.\n\n· Software experience should include,Civil 3D, Hydro-flow, Hydro-CAD, AutoCad, Microsoft Office.\n\n· Experience in Site Layout, Grading, Drainage, Utility, Erosion Control, and Lighting Design.\n\n· Analytical ability, pro-active attitude, and ability to think “outside the box” when required.\n\n· Familiarity with analyzing local zoning ordinances and NJDEP permitting.\n\n· Professional Planning License a plus, but not required.\n\nPrimary Duties and Responsibilities\n\n· Project planning, including providing recommendations, preparing cost estimates, and developing solutions.\n\n· Site plan design and preparation of specifications.\n\n· Preparation of and management of NJDOT Local Aid, Open Space, and CDBG grant applications and programs.\n\n· Review Site Plan and Subdivision applications.\n\n· Represent the Firm at Planning and Zoning Boards\n\n· Financial project tracking and budget analysis\n\n· Provide project team support (internal and external)\n\n· High level client interaction and management\n\n· Coordination of project tasks with sub-consultants\n\n· Preparation of Public Bid Documents\n\n· Management and Training of Staff\n\nCompensation and Benefits\n\n· Competitive Salary Based upon Experience\n\n· Medical, Dental and Vision Insurance\n\n· Life Insurance\n\n· Section 125 Plan (Flexible Spending Account)\n\n· 401k Plan with matching percentage\n\n· Paid vacation and sick time\n\n· Aflac - Additional Insurance\n\nJob Type: Full-time\n\nJob Type: Full-time\n\nPay: $29.00 - $36.00 per hour\n\nExperience:\n\nengineering: 4 years (Preferred)\nautocad: 4 years (Preferred)\ncivil engineering: 4 years (Preferred)\n\nBenefits:\n\nHealth insurance\nDental insurance\nVision insurance\nRetirement plan\nPaid time off\n\nSchedule:\n\nMonday to Friday\n\nBenefit Conditions:\n\nWaiting period may apply\n"}, {"company_name": "Renaissance Learning, Inc.", "job_title": "Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=956799&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_b82b8be7&cb=1598754125951&jobListingId=3648937102", "job_description": "Company DescriptionWhen you join Renaissance®, you join a global leader in pre-K–12 education technology. Renaissance’s solutions help educators analyze, customize, and plan personalized learning paths for students, allowing time for what matters—creating energizing learning experiences in the classroom. Our fiercely passionate employees and educational partners have helped drive phenomenal student growth, with Renaissance solutions being used in over one-third of US schools and in more than 100 countries worldwide. Every day, we are connected to our mission by exemplifying our values: trust each other, win together, strive for the best, own our actions, and grow and evolve.Job DescriptionDo you want to help develop products that truly make a difference in the lives of millions of students? Then this role is for you! As a Software Engineer, you’ll work in an Agile Scrum environment, collaborating with a group of highly talented software engineers to design and build our next generation of web applications.\n\nIn this role, you will:\n\nUse the latest modern frameworks, such as .NET Core, Angular is 7.2 , and GraphQLInfluence a new CI build process using Git, Terraform, Ansible, Jenkins, and DockerUnderstand AWS Cloud and troubleshooting distributed systems -working in DynamoDB, Elastic Search, and serverless systems Be a part of an agile team that is truly committed to code quality and innovation\n\n\nQualificationsFor this role, you must have:\n\n3-5 years professional experience in full-stack development with a recent focus on building web-based applications.Extensive experience with various engineering technologies such as:\n\n\nC#, Java, or other object-oriented languagesJavaScript and familiarity with frontend frameworks like Angular, React or similarSQL (MSSQL, PostgreSQL) and MongoDB or other NoSQL databases\n\nBonus points for:\n\nExpertise developing enterprise-level web applications and RESTful APIs using microservices, and event-driven architecturesExperience leading and mentoring othersExperience working in an Lean/Agile/Scrum environmentKnowledge of DevOps processes and technologies around version control, test automation frameworks, continuous integration/deployment and production monitoring & support\n\n\nAdditional InformationBenefits:\n\nMedical, Dental & Vision401K Generous Tuition & Professional Development Reimbursement 10+ paid holidays2 Volunteer Days off yearly14 weeks fully paid family leave\n\nAll your information will be kept confidential according to EEO guidelines."}, {"company_name": "Red Balloon Security, Inc.", "job_title": "Software Development Engineer in Test", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=973187&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_34070c1e&cb=1598754125950&jobListingId=3093143865", "job_description": "--EMAIL jobs@redballoonsecurity.com to apply ---\nJob Description\nAs a Software Development Engineer in Test, you would join a team of security researchers and software developers. Your role would be dedicated to test and validate Red Balloon Securityâ\u0080\u0099s embedded security solution. You would be a part of verifying cutting edge embedded security software used in devices across a range of industries.\nResponsibilities\nâ\u0080¢ Lead and engage with engineering team to improve software development production and release speed\nâ\u0080¢ Develop the engineering teamâ\u0080\u0099s test coverage by defining testing setup and metrics; designing test cases and procedures; and documenting the testing results\nâ\u0080¢ Increase the automation of tasks and expand test coverage through both new and existing infrastructure\nâ\u0080¢ Write and debug test cases, as well as analyze and review testing results\nRequired Education, Experience, Skills\nâ\u0080¢ BS/BA in Computer Science, Computer Engineering, or similar technical field of study or equivalent practical experience\nâ\u0080¢ At least 2 years of professional work experience in continuous integration testing\nâ\u0080¢ Strong attention to detail, an ability to multitask, and an ability to work independently and on a team\nâ\u0080¢ Must be passionate about testing and validating an embedded product\nThis is a full-time, in office position. \nCompany Description\nRed Balloon Security is a leading security provider and research firm for embedded devices across all industries. Founded in 2011 by Dr. Ang Cui, the company's core technology, Symbiote Defense, was originally developed within Columbia University's Intrusion Detection Systems Lab. Red Balloon Securityâ\u0080\u0099s pioneering R&D is led by a team of world-class academic researchers and developers who have published seminal research papers in the fields of embedded security and intrusion detection, led US Department of Defense funded research activities, ethically disclosed vulnerabilities within hundreds of millions of ubiquitous embedded devices and worked as embedded security researchers within various intelligence agencies."}, {"company_name": "Ivalua", "job_title": "Senior Customer Application Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1043776&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_101895ec&cb=1598754125954&jobListingId=3620007457", "job_description": "Senior Customer Application Engineer\n\nThis is an exciting opportunity for a Senior Customer Application Engineer / Senior Engineer at Ivalua. You will be first point of contact for Clients who have implemented Ivalua Solution and are engaged with us in the Maintenance / Support (post go live) workstream. (knowledge of Spanish is a plus, but not mandatory)\n\nAbout Ivalua\n\nIvalua is developing a new generation of Procurement technology products. A \"Magic Quadrant\" leader, Ivalua's solutions work in a complex global economy. Our innovative Procure-to-Pay solutions include automating configured workflows to request, procure, receive, and pay for goods and services across the enterprise, refining the procurement lifecycle while reducing cost and risk of spending on indirect goods, direct goods and services, and improving supplier collaboration.\n\nAbout the Team:\n\nYou will be part of the Support Team whose mission is to maintain customer applications, successfully deliver enhancements, updates and upgrades to customers, proactively monitor production environments and take actions to improve the overall user experience and the business value provided to our Customers. The Support Team operates with high quality standards and strong commitment to excellence and efficiency. Our team is very hands-on with a strong mindset of problem solving while also having the ability to think of the implementation holistically and provide solutions that solve the customer's long-term challenges.\n\nOur team works hard, plays hard and enjoys all indoor and outdoor activities that the company organizes from time to time, so that you can focus, work collaboratively, and be at your creative best.\n\nKey Responsibilities:\n\nManage the customer relationship. Gather business requirements and analyze the impact on the implemented solution. Advise Customers on procurement leading practices and configuration management.\nUse Ivalua Buyer technical framework (C# .NET & SQL) to configure and customize Ivalua Buyer solution to meet specific business requirements\nReverse engineering and debugging to solve project issues throughout all phases of the implementation cycle\nDevelop advanced configuration knowledge and show strong technical creativity skills to leverage configuration features in order to limit custom code\nInteract with R&D team for product features\nManage deliveries and solve technical operational issues\nContribute to peer code review\n\nSkills You Need to Succeed:\n\n4+ years of experience in software development, primarily in C#, .NET and SQL Server\nAbility to understand complex functional and technical environments and communicate technical concepts to non-technical people\nServe as mentor to colleagues and project teams\nComfortable looking for configuration solutions versus new coding and development\nFunctional knowledge of SRM, Supply Chain, and/or Procurement is a plus\nManage client relationships, self-driven, results oriented, strong leadership and exceptional communication skills\nOccasional travel and on call requirements\nYou will go through Ivalua's certification process to learn the Product.\nWorking knowledge of Spanish required\n\nPreferred Education:\n\nBachelor (BS) degree in Computer Science, Software Engineering or a closely related field or foreign equivalent\n\nWatch the Ivalua Video: https://vimeo.com/363634218\n\nJoin Ivalua today and procure a great future for your career!"}, {"company_name": "SeatGeek", "job_title": "Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1026709&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_c7485f62&cb=1598754125960&jobListingId=3607614480", "job_description": "The ticketing industry is messy, complex and makes attending live events more difficult than it is; we believe a thoughtful application of software can fix that.We're looking for bright, curious engineers who want to help millions of people experience the thrill of live entertainment. SeatGeek is a product-centric organization that deploys code into production multiple times per day. Our application is built in the microservice architectural style and we aim to use the best language for the task at hand. As we grow, the scale of our technical challenges - and their effect on our customers - continues to increase. We want to ensure we continue to build the best product we can.What you have\n\nExperience building web applications, especially within a microservices architecture. We'll be most interested in hearing about what you've built\nExperience solving complex technical challenges. SeatGeek engineers have had to create custom solutions to rather unique ticketing problems, including venue mapping, inventory tracking, and event matching. We'll be excited to hear about challenging problems you've solved\nExperience with at least one language and comfort with several others\nPassion for software craftsmanship and product. You have well-considered opinions about how software should work, and hold yourself and your code to a high standard\nCommitment to your teammates. You enjoy working with a diverse group of people with different experiences and take pride in mentoring and learning from others\n\nThe Tools We UseYou absolutely do not need experience with all of these, but we thought you might be curious. Tools can be learned, so we care much more about your general engineering skill than knowledge of a particular language.\n\n\nLanguages: Python (our primary language), C#/.NET Core, Go and PHP\nDatastores: MySQL, Postgres, Redis, RabbitMQ and Elasticsearch\nServer: Nginx, Tornado and flask for Python, all running on AWS\nMonitoring: DataDog & PagerDuty\nVersion control: Git\nClientside: we make heavy use of React/Redux on the frontend\n\nPerks\n\nEquity stake in a well-funded growth stage company\nA superb benefits package that supports health/dental/vision. We also provide annual subscriptions to Headspace, Ginger.io, and One Medical\nA focus on transparency. We have regular company meetings and Q&A panels where employees can chat openly with teams across SeatGeek, our co-founders, and external guests from the industry\nAlthough this perk is currently on pause, we can't help but talk about it. SeatGeek employees receive a monthly ticket-purchase stipend, and we cannot wait to get back to safely attending the live events that we so dearly miss\nCovid-19 Response: We're not expecting employees to return to the office until January 2021 at the earliest. Once it's again safe to do so, we look forward to welcoming people back to our offices. In the meantime, we're offering a $1000 reimbursement to create your ideal workspace at home\n\nSeatGeek is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come join us!"}, {"company_name": "Narrativ, Inc.", "job_title": "Senior Fullstack Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1003188&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_901a420f&cb=1598754125958&jobListingId=3585688582", "job_description": "\nAbout Narrativ\n\nNarrativ is a technology platform for brands to unlock, manage, and grow their share of product reviews on the open web.\n\nWhy is this important? We've seen a decade's worth of e-commerce growth in 2020, and the emergence of a smarter consumer who demands a better way to buy than ads. They're turning to expert product reviews on trusted sources ranging from The New York Times to their favorite YouTuber. But only Amazon is reaping the benefits today, commanding a $40B monopoly on product reviews online.\n\nNarrativ's patented technology empowers everyone to win. We build the tech and tools to turn honest reviews that tell the whole story about a product into a multibillion dollar acquisition channel for all brands. Teams at Sephora, Best Buy, L'Oreal and hundreds of others already partner with Narrativ to yield more efficient results than Facebook and Google.\n\nOur work breaking Amazon's monopoly and fixing broken and out-of-stock links on the Internet has gotten us recognized by The World Economic Forum as a Technology Pioneer and by Fast Company as one of the best places to work for innovators.\n\nWhy you should work here:\n\nWe're growing, fast: Narrativ's platform hosts 50+ partners spending $20mm+ a year including Best Buy, L'Oreal, Sephora, Bed Bath & Beyond, Home Depot, Nordstrom, and Samsung. We've doubled revenue so far in 2020.\nWe have a talented team: We're a team of 50+ from places like Amazon, Facebook, Google, and Etsy with a female founder that's been awarded by the Financial Times, Forbes, and Inc. We're hiring quickly, with plans to double our team in the next year.\nWe're challenging the status quo: Breaking monopolies and diversifying industries is in our DNA. Come join us on our mission to democratize product recommendations for all and build a better internet for shoppers.\n\nCome join us on our mission to build a better Internet for shoppers!\n\nThe Job:\n\nNarrativ is looking for a full stack software engineer to build well-performing, highly usable applications to manage millions of dollars of gross merchandise value in Narrativ's groundbreaking marketplace. You care about fast loading times, idiomatic APIs design, and usability. You're comfortable using a relational database like PostgreSQL or MySQL, and know when to use alternative databases like Redis for caching. You work well with designers, product people, and other engineers to continuously release new features and improvements.\n\nYou are a Fullstack Engineer at Narrativ\n\nMission:\n\nBuild snappy, intuitive web applications to control millions of dollars of gross merchandise value.\nBuild search and reporting interfaces to interact with terabytes of data.\nCreate API endpoints and supporting SDKs to gather product recommendation and purchase information in realtime and batch modes.\n\nKey Results:\n\nNew account management UI that reduces the currently high rate of error when configuring merchant campaigns.\nIncrease the number of accounts a single growth manager can handle by creating tools and automation to multiply their ability\nReduce the amount of manual work required to detect and resolve integrations issues by building more resilient systems and improved SDKs\nSupport the planned growth of new merchants and maintenance of existing merchants for 2020 and beyond (currently under 50, EOY target over 120-150).\n\nCore Responsibilities Include:\n\nManage a team of engineers in different stages of their careers; make them better at their jobs, advocate for the, and unblock them\nEnsure quality and ease of deployment by writing thorough unit, integration, and end-to-end tests.\nRefactor and tackle technical debt in the code base. Improve team capabilities with documentation, code reviews, and pair programming.\nPut in place best practices that allow for experimentation using data.\nLead sprints and sprint planning while syndicating the companies values, mission and objectives in all that we do\nTake part in the software planning process, e.g. creating and estimating JIRA tickets, QAing feature, etc.\nEnhance business and tech stakeholder relationships\nBuilding and hiring a team almost from scratch\nThis role is front-end leaning\n\nRequirements:\n\n\n\n5+ years building full-stack applications using (JavaScript, TypeScript, Elm or similar in the frontend; Python, Elixir, Ruby, Node.js or similar on the backend)\nWorking knowledge of basic SQL and relational databases like PostgreSQL or MySQL.\nExperience with some frontend framework like React, Angular, Vue or similar.\nThe dedication to keeping up with new developments in tech\nStrong communication and organizational skills, motivation to achieve results in a dynamic, fast-paced environment\n\nImportant Notice: We are putting the health and safety of our employees first. For the balance of 2020, we'll be working from home. WIth so much uncertainty in the world, this is a decision that helped eliminate the anxiety associated with commuting and gave our teammates one less thing to worry about.\n\nNarrativ is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or veteran status."}, {"company_name": "Grubhub, Inc.", "job_title": "Software Engineer I", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=904396&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_4354c452&cb=1598754125954&jobListingId=3629635282", "job_description": "About The OpportunityGrubhub is dedicated to connecting hungry diners with our wide network of restaurants across the country. Our innovative technology, easy-to-use platforms and streamlined delivery capabilities make us an industry leader today, and in the future of online food ordering.  We strive to create a workplace that reflects the diversity of our customers and the communities we serve. When you join our team, you become part of a community that works together to innovate, solve problems, take risks, grow, work hard and have a ton of fun in the process! Why Work For UsWe have a fast-paced environment and that is what our teams thrive on. Grubhub believes in empowering people and offering opportunities for development, as well as professional growth. We value strong, positive relationships in all areas: with each other, our customers and our greater community. Want to be a part of a team of diverse collaborators in an authentically fun culture? If so, we want to talk to you - and hear what’s your favorite restaurant for food delivery!Design, implement, and deliver awesome technical platforms and products for all constituencies (diners, corporate accounts, restaurants, internal tools)Understand our products from both a technical and business perspective in the context of our larger business.Communicate with leadership, product owners, other technologists, and users to create working software based on an understanding of business and technical priorities.Break down complex problems into elegant technical solutions to intelligently solve problems for diners, restaurant, corporate accounts and internal stakeholders.Actively contribute to the adoption of strong software architecture, development best practices, and new technologies. We are always improving the process of building software; we need you to help contribute.You will be a key part in accurately estimating the timing of software delivery.Bachelor’s Degree in Computer Science, Software Engineering or related fieldStrong track record of strong academic performance (3.0 or higher cumulative GPA)Solid foundation in software programming in one or more of the following languages: Java, Python, C, C++, Ruby, Scala, C#, Objective CEagerness to contribute in a team-oriented environmentAbility to work creatively and analytically in a problem-solving environmentFamiliar with Agile software development methodologiesInterested in working for a fast paced tech and product oriented companyFlexible PTO. Grubhub employees are provided a generous amount of time to recharge their batteries. Health and Wellness. We provide programs that support your overall well-being such as generous medical benefits, employee network groups, company-wide fitness challenges, and a comfortable and casual workplace! We also support our parents by offering 8 weeks of paid parent bonding time, a 4-week returnship program, and 6-8 weeks paid medical leave.Learning and Career Growth. Your personal and professional development is a priority at Grubhub. From day one, we empower you to lead and be an active participant in your career growth. We provide continuous learning opportunities, training, and coaching and mentorship programs. MealPerks. Who’s ready for some lunch? We provide our employees with a weekly Grubhub credit to enjoy and support local restaurants. We also offer company-wide meals several times a year to bring our Grubhub family together.Fun. Every Grubhub office has an employee-led Culture Crew that connects people through fun, meaningful events and initiatives. Some of our popular past events include: Wing-eating contests, Grubtoberfest, 5k Runs, Bring Your Child to Work Day, regular happy hours, and more!Social Impact. We believe in the importance of serving the communities that support our business. In addition, employees are given paid time off each year to support the causes that are important to them. Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster. If you are applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address.  CA Privacy Notice: If you are a resident of the State of California and would like a copy of our CA privacy notice, please email privacy@grubhub.com. "}, {"company_name": "HC Technologies LLC", "job_title": "Software Engineer, Senior - C++ (CoreDev)", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1078147&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_17ba50ef&cb=1598754125951&jobListingId=3351601346", "job_description": "Software Engineer, Senior C++ (core dev) at HC Technologies (New York)\r\nAbout Us:\nHC Technologies is a premier algorithmic and discretionary trading firm with a specialty in the Foreign Exchange and Futures markets. With offices in Chicago, New York and London, we unite talented individuals with innovative technology and robust risk management to identify trading opportunities within the global marketplace. HC Technologies is ranked number one in Euromoney's 2018 FX survey for market share in the Americas region and is a direct trading member of the CME Group exchanges, ICE Europe, ICE US, and Eurex.\nJob Description:\nWe are seeking a talented Senior Level C++ Developer to join our core engineering team. In this role, you will help design, develop, and implement our real-time financial trading applications. You will work cross-functionally with various stakeholders, trading teams, and technology departments to ensure our applications are running at optimal performance.\nYour general milestones for the first year are the following:\n\nWithin two months, learn fundamentals of the high-performance trading system API and development frameworks\nWithin 3 months be able to use the company’s development process including revision controls, pull requests, feature planning, and built environments\nWithin 6 months, develop an understanding of FX and Futures trading and risk controls\nWithin 9 months, be able to implement and simulate a basic trading model with supervision\nWithin one year, be able to make feature enhancements to core components with some supervision and to diagnose problems and propose solutions to trading systems components. May also be required to work with traders and quants to implement or enhance trading systems or predictive models\n\nResponsibilities:\n\nBuild, design, and operate mission-critical systems that are dependent on financial market transitions\nDesign and develop core components in C++\nResponsible for working with various teams on core trading software infrastructure\nCollaborate with quantitative traders to design and test trading models\nCreate and implement system testing procedures\n\nQualifications:\n\nSolid understanding of Linux System, can do efficient, reliable programming\nStrong proficiency with GNU, or Intel C/C++ compilers, SQL and Git\nProficiency in socket programming\nSolid understanding of CPU architecture and cache analysis.\nStrong Familiarity with testing frameworks\nStrong familiarity with common tools (make, git, bjam, valgrind, unittest, gdb, etc)\nKnowledge of trading futures and FX system preferred, but not required\n\nDesired Experience:\n\nPrevious experience designing and implementing new systems and features independently\nBrings production support experience and can troubleshooting issues under pressure\nPrevious experience with application profiling and debugging\nFamiliarity with common frameworks (Boost) and Java, Python, and Perl\nBA/BS in Computer Science, Information Science, Engineering, Math, or 5 years of equivalent experience\n\nBenefits:\n\nCompetitive base salary and bonus\nExcellent benefits that include robust medical, dental, life insurance, 401k, and vision plans\nA casual and open work environment without cubicles\nPlenty of snacks, coffee/espresso, and catered lunches every Friday\nQuarterly team building exercises\nAbility to partake in offsite charities and community service events\n"}, {"company_name": "adMarketplace, Inc.", "job_title": "QA Software Engineer (SDET)", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1081772&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_61d2c377&cb=1598754125953&jobListingId=3609309108", "job_description": "At adMarketplace, we create best of breed advertising technology using cutting-edge microservice architectures with millisecond response times and crunch through terabytes of data every day.\n\nThe ideal candidate is motivated to improve software quality by automated and continuous testing and has a desire to push the boundaries of using latest software testing technologies/solutions in an automated way.\n\nResponsibilities:\n\nWork with business and the engineering teams to understand product requirements (both business and technical) and create test plans and test casesDevelop new test frameworks/libraries for API/Front End software testing using Java following software development standardsMaintain/improve existing automation test frameworks and test suitesPerform non-functional testing (performance and integration testing) to our large-scale distributed Ad Serving and Click Tracking platforms, and other ad tech related softwareSupport development team to ensure that software meets functionality, performance and quality requirementsMaintain test infrastructure to ensure validity and reliability of test execution and resultsWork closely with the DevOps team to create/configure containerized test environments to achieve seamless test integration in local and AWS environments using tools like Jenkins, DockerSupport application deployment to Production and perform UAT/Smoke/Sanity testingWork with developers to troubleshoot/investigate issuesCreate/maintain testing documentation following team-wide document standards\n\nRequirements:\n\nBS in Engineering, Computer Science or related discipline3+ years experience with API (e.g. Restful) and Front End (e.g. Selenium) automationMust have experience working in Linux environmentSolid experience in at least one of the common unit test frameworks (e.g. Junit, TestNG, etc)Experience with some of the common performance test tools (e.g. Jmeter, Loadrunner, etc)Solid understanding and knowledge of Java (Classic) languageFamiliar with Maven, Eclipse IDE/IntelliJ IDEA, SQL, and shell scriptingExcellent communication, documentation and troubleshooting skillsAble to work independently with minimal supervisionNice to have:\n\nDigital advertising industry experienceExperience with Python, JavascriptExperience with NoSQL DB (e.g. MongoDB, DynamoDB, Aerospike, etc)Familiarity with Docker, AWS, and Microservices\n"}, {"company_name": "Braen Stone Company", "job_title": "Mining Engineer", "company_location": "Haledon, NJ", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=988817&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_bdb6a339&cb=1598754125951&jobListingId=3399632887", "job_description": "Mining Engineer, HaledonGeneral Information\n\n\nJob Title:Mining Engineer\n\nLocation:400 Central AveHaledon, NJ, 07508United States\n\nRelocation Expense Covered:Yes\n\nEmployee Type:Exempt\nContact information\n\n\nName:Maria Vargas\n\nEmail:MVargas@braenstone.com\nDescriptionMining Engineer\n\nALL QUARRY LOCATIONS\n\nJob Description\n\nOvertime Status: Exempt\n\nBraen Stone Companies is looking for a recent college graduate with a degree in either mine, civil or explosives engineering to join our growing team. Braen Stone Companies is a family-owned, 115-year-old business operating five (5) locations in Northern New Jersey. While our primary business is the production of aggregate and asphalt products, we also have a retail operation which specializes in landscape, masonry and hardware building supplies. The mining engineer will undertake the formulating, managing and execution of mine and blasting operations for four open pit hard rock quarries.\n\nThis is considered a safety- sensitive position subjected to the Company’s Controlled Substance and Alcohol Policy.\n\nThis individual will be looking to start their career in the field of mining and must be intelligent, have excellent judgment, be computer savvy and possess proven knowledge of mine planning. Candidate must be mature, dependable, and have excellent organizational skills. The candidate should be able to formulate, manage and execute mine plans and blasting operations in order to provide several million tons per year of blasted feed stock to four open pit hard rock quarry operations.\n\nKey Responsibilities/Essential Job Functions:\n\nManage all drilling and blasting operationResponsible for managing all drilling and blasting operations at each quarryExplosives use reporting to NJ DOLDaily travel to multiple sitesOversee and evaluate all seismograph machines and readingsOperate borescope to inspect all drilled holesMeet with production managers daily to determine the needs of each quarryAssess all borehole information in regards to geology and quality controlAssist Safety Director/ManagerAttend Raffles safety seminarsEnsure company environmental and safety compliance standards are metWorking with specialized planning softwareFamiliarize and maintain all company policies and proceduresTrack and approve invoicesDesign one, three and five year mine plans in line with budgeted production requirements\n\nPlease note that although every effort has been made to craft a thorough job description, this is a fluid document which will be updated, modified, and added-to, as necessary.\n\nRequired Knowledge/Skills/Aptitudes:\n\nComputer Skills- AutoCad and ExcelStrong communication and team building skillsCooperation with colleagues, supervisor and management\n\nRequired Education & Experience:\n\nBachelor’s Degree in either Mine, Civil or Explosives engineeringConstruction, manufacturing, landscaping industry experience, a plusStrong computer skills essentialAutoCad, Excel\n\nPhysical Demands:\n\nRepetitive stopping, bending, crouching as required to perform dutiesAbility to lift/carry at least 50-100 pounds unaccompaniedCandidate must be able to stand for extended periods of timeWork is performed outdoors in all weather conditionsPeriodical exposure to high levels of noise, grease & dust\n\nExpected Hours of Work: Hours of work are generally 7:00am to 5:00pm, Monday through Friday however work on the weekends may be necessary, as well.\n\nTravel: This position is based in Haledon, NJ with expected travel daily to Franklin, NJ, Sparta, NJ and Ringwood, NJ.\n\nBraen Stone Industries has been family owned, operated, and oriented for over 115 years. We want the best for our employees! With that said, we promote a healthy lifestyle, offer competitive pay, encourage time off to relax and rejuvenate and provide the tools to retire in style!\n\nVacation daysPaid HolidaysMedicalDental401(k) Flexible Spending AccountAFLACComprehensive wellness program with financial rewards!Braen Gear…who doesn’t love a free shirt, beach towel, or jacket?Thanksgiving TurkeyA blowout of a Christmas PartySummer Family Picnic (think zip lining, swimming, boating, eating, and the competitive Company softball game!)Safety Program- Get caught doing some good and earn some really cool prizesMatching Gift programCareer Development opportunities\n\nExplore Our Hiring Process\n\nYou’re sold, you want to be a part of the Braen team. Here’s a glimpse at our hiring process.\n\nApply- We won’t know you’re interested if you don’t apply! Interview- Come in once or twice so we can learn more about you and also, to meet the people you’ll be working with. This is your chance to interview us too!Offer Letter- Will you be a part of our team? Sign, date and return if it’s a Yes!Background Check- Standard background check…nothing to be afraid ofPhysical and Drug/Alcohol Screen- We are proud to be a drug-free workplace\n"}, {"company_name": "Hudson River Trading LLC", "job_title": "FPGA Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=871239&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_a111132e&cb=1598754125960&jobListingId=3353403135", "job_description": "Working as an engineer at Hudson River Trading (HRT) means working on a small, highly productive, and efficient team. At HRT, a fully automated trading firm based in NYC, the code you write *is* our business, so it is everyone's job, top to bottom, to make sure our core dev team has everything they need to do their jobs well.\n\nAs an FPGA Software Engineer you will be working at the cutting edge of low-latency trading, collaborating closely with strategy developers and hardware developers to build best-in-class trading systems. This is a role with many hats; you'll help conceptualize new kinds of trading, optimize low level code, design new APIs, deploy and monitor live trading systems, build tools and testing infrastructure, and plan physical networking layouts. Your job will be to help figure out what hardware to build, how to build it, and then how to seamlessly integrate it into the existing trading environment.\n\nThe Skills:\n\nExcellent design, debugging, and problem solving skills.\nC++ expertise is required.\nKnowledge of UNIX operating systems (we use Linux), system/processor performance, and network communication.\nPrevious exposure to Verilog and FPGAs preferred.\n\nThe Profile:\n\nYou possess a bachelor's degree in Computer Science, Engineering, or a related field.\nYou are capable of working independently as well as part of a team.\nYou can analyze and fix problems quickly.\nCan look at code, figure out how it works, and how to make it better.\nCan describe software designs at a high level (the abstract interface), low level (step-by-step algorithm), or anywhere in between.\nYou really like to work with people who challenge you and make you better at what you do.\nIn your spare time you: code, tinker, read, explore, break things, and have an insatiable curiosity for all things computer related.\n\nCulture\n\nHudson River Trading (HRT) brings a scientific approach to trading financial products. We have built one of the world's most sophisticated computing environments for research and development. Our researchers are at the forefront of innovation in the world of algorithmic trading.\n\nAt HRT we come from all sorts of backgrounds: mathematics, computer science, statistics, physics, and engineering. We're a community of self-starters who are motivated by the excitement of being at the cutting edge of automated trading. Our culture celebrates great ideas whether they come from HRT veterans or new hires. At HRT we're friends and colleagues, whether we are sharing a meal, playing the latest board game, or writing elegant code. We embrace a culture of togetherness that extends far beyond the walls of our office.\n\nSeem like something you might be interested in? Our goal is to find the best people and bring them together to do great work in a place where everyone is valued. HRT is proud of our diverse staff; we have offices all over the globe and benefit from our varied and unique perspectives. HRT is an equal opportunity employer; so whoever you are, we'd love to get to know you."}, {"company_name": "Red Balloon Security, Inc.", "job_title": "Software Development Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=860455&s=149&guid=000001743d2bf582b097a92b919cc8d7&src=GD_JOB_AD&t=SRFJ&vt=w&ea=1&cs=1_dee9d3a3&cb=1598754125945&jobListingId=3622951094", "job_description": "---EMAIL jobs-software@redballoonsecurity.com TO APPLY---\nJob Description   \n\nDevelop and scale reverse engineering toolchain towards a distributed architecture.\nDesign and implement a large-scale automated test farm.\nCollaborate with security research staff to design and implement the infrastructure for the deployment of host-based defense software for black-box embedded devices.\nOptimize performance of core backend applications when dealing with extensive operations over massive sets of binary data.\nDevelop and maintain in-house firmware reverse engineering framework.\n\n \nRequired Skills and Qualifications\n \n\nBA/BS in computer science, engineering, or a related major.\nExpertise in at least one OO programming language.\nUnderstanding of modern software design and engineering practices.\nHigh level of self-initiative and self-motivation.\n\n \nBonus Skills and Qualifications \n \n\nExperience with ARM / MIPS / PPC assembly languages.\nStrong understanding of OS design and implementation.\nProficiency in hardware and software reverse engineering.\n\n \nThis is a full-time, in office position. \n\n---EMAIL jobs-software@redballoonsecurity.com TO APPLY---"}, {"company_name": "Citadel Securities LLC", "job_title": "Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=162252&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_db2c89a3&cb=1598754125957&jobListingId=3430116652", "job_description": "\nJob Description\n\nRole Summary\n\nAt Citadel Securities, a leading global market maker, our team of Software Engineers create next generation software solutions to support business areas across the firm. Software Engineers work closely with business leaders to develop and deliver custom software solutions that optimize performance and efficiency.\n\nOpportunities available in Chicago, New York, London, Sydney, Hong Kong\n\nObjectives\n\nDesign, develop, test, and deploy elegant software solutions across the firm\nPartner with business leaders to define priorities and deliver custom solutions\n\nSkills and Preferred Qualifications\n\nA deep passion for technology and software development\nProficiency within one or more programming languages including C, C++, Python, R, C# or JavaScript\nExperience with some of the following: Distributed Computing, Natural Language Processing, Machine Learning, Platform Development, Networking, System Design, and/or Web Development\nBachelor’s, Master’s or PhD degree in Computer Science or equivalent experience\nStrong written and verbal communications skills\n\nAbout Citadel SecuritiesCitadel Securities is a leading global market maker across a broad array of fixed income and equity securities. Our world-class capabilities position us to meet the liquidity demands of our diverse group of institutional clients in all market conditions. In partnering with us, our clients, including asset managers, banks, broker-dealers, hedge funds, government agencies and public pension programs are able to gain a powerful trading advantage and are better positioned to meet their investment goals.\n\nThe team makes its mark every day from our offices around the world: Chicago, New York, London, Hong Kong, Toronto, Shanghai, Sydney, Dublin.\n"}, {"company_name": "Citadel LLC", "job_title": "NXT â\u0080\u0093 Software Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=708312&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_459517f9&cb=1598754125947&jobListingId=3403007623", "job_description": "\nJob Description\n\nSoftware Engineers at Citadel create next generation software solutions that help produce systems that power our investment research, trading, risk management, and funding & settlement systems. Software Engineers continually improve the efficiency and effectiveness of our investment process and reduce operational risk. Software Engineers partner closely with business leaders to develop and deliver software solutions that drive meaningful business outcomes. We build a range of critical solutions from pre-trade research platforms to trading systems to post-trade clearing and settlement services. These solutions include high availability, high throughput systems scaling to millions of transactions per second.\n\nWe’re looking for premier Software Engineers to join NXT, Citadel’s Technology Network. NXT offers a combination of training, experience, and exposure to get you to the next level in your career. As a NXT Software Engineer, you will apply your engineering skills to help our trading desks answer questions like: What percentage of customers of one brand are going to switch to another brand? Which upcoming IPOs will be more successful than others? What is the correlation between weather patterns and other variables?\n\nYOUR OPPORTUNITY:\n\n\nDesign, develop, and deploy elegant software solutions across the firm\nPartner with business leaders to define priorities and deliver custom solutions\nReceive structured learning on technical and quantitative skills\nDevelop under the direct sponsorship of our firm’s CTO and engage with other C-level leadership\n\nYOUR SKILLS & TALENTS:\n\n\nPassion for technology and software development\nProficiency with one or more object oriented languages (e.g., Java, C++, Python)\nDeep knowledge of distributed service oriented architecture, relational databases, machine learning/deep learning\nExperience building high performance, highly available and scalable systems\nExperience building complex software systems that have been successfully adopted by customers over extended time periods\nAbility to deliver short term results while invest in long term strategic solutions\nStrong written and verbal communications skills\nBachelor’s, Master’s or PhD degree in Computer Science or equivalent experience\n\nWant to learn more about what an actual day is like for a developer or software engineer at Citadel? Hear from our own Ben Siegel at https://youtu.be/gPN5_JV43s8.\n\nAbout CitadelCitadel is a global investment firm built around world-class talent, sound risk management, and innovative leading-edge technology. For a quarter of a century, Citadel’s hedge funds have delivered meaningful and measurable results to top-tier investors around the world, including sovereign wealth funds, public institutions, corporate pensions, endowments and foundations.\n\nWith an unparalleled ability to identify and execute on great ideas, Citadel’s team of more than 675 investment professionals, operating from offices including Chicago, New York, San Francisco, London, Hong Kong and Shanghai, deploy capital across all major asset classes, in all major financial markets.\n"}, {"company_name": "SeatGeek", "job_title": "Software Engineer, Application Platform", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1026709&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_8870244f&cb=1598754125958&jobListingId=3637888197", "job_description": "More than just solving the Knapsack ProblemHow do you deal with the traffic generated when millions of fans want tickets to that hot new artist's concert? How do you make sure you don't sell the same courtside seat twice when hundreds of users click the button within the same microsecond? How do you quickly let 100,000 fans in the stadium before the game starts? What is the most optimal seating arrangement for a family of 5 who wants to see their team win on its home court? How do you determine the optimal price for a ticket? How do you ensure that fans discover those tickets? How do you build the experience that will make that day an unforgettable experience?\n\nSince our inception, SeatGeek has focused on using technology to answer the big questions of the live events industry. Our obsession with product, data, and engineering is the competitive advantage that has empowers our startup to be the end-to-end platform used by everyone, from NFL teams to the biggest names in live music, to manage, sell, and promote their events.Our Application PlatformLike many other startups, SeatGeek started off as one application, one database, one website. Over time, our user base grew to the millions, and we started offering new and more sophisticated products to users, event managers, and promoters. This has required us to expand our original software and build many other systems and services that collaborate to deliver our products and services.\n\nThe explosion of new systems and services gradually formed an ad-hoc platform; our shared knowledge of what tools, patterns, and architectures work and don't work when building and evolving systems. This oral history-based approach worked well for our first years, but we know that to face our next growth stage we need to be more explicit and structured about the platform used by the applications that empower our product.\n\nAnd this is the mission of our Application Platform team. We build and maintain systems, architecture patterns, and protocols used by applications to build services. We own our API and BFF strategy, authentication & authorization, observability, and many services that are on the critical path for our users.Who you areWe are looking for engineers who have a passion for and experience in building production-ready distributed applications using microservices.\n\n\nYou have solid experience in at least two programming languages like Python, Go, C#, or Java.\nYou have extensive experience in building distributed systems communicating through technologies such as HTTP, gRPC, Kafka, and RabbitMQ\nYou have a good understanding of storage systems such as Postgres, MySQL, DynamoDB, and Redis, including complex queries and optimization\nYou are very experienced in distributed architectures, Test-Driven Development, API design, and architecture patterns\n\nPerks\n\nEquity stake in a well-funded growth stage company\nA superb benefits package that supports health/dental/vision. We also provide annual subscriptions to Headspace, Ginger.io, and One Medical\nA focus on transparency. We have regular company meetings and Q&A panels where employees can chat openly with teams across SeatGeek, our co-founders, and external guests from the industry\nAlthough this perk is currently on pause, we can't help but talk about it. SeatGeek employees receive a monthly ticket-purchase stipend, and we cannot wait to get back to safely attending the live events that we so dearly miss\nCovid-19 Response: We're not expecting employees to return to the office until January 2021 at the earliest. Once it's again safe to do so, we look forward to welcoming people back to our offices. In the meantime, we're offering a $1000 reimbursement to create your ideal workspace at home\n\nSeatGeek is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come join us!"}, {"company_name": "Audible, Inc.", "job_title": "Software Development Engineer II", "company_location": "Newark, NJ", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=485504&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_8bb3b3d2&cb=1598754125955&jobListingId=3638260522", "job_description": "If you are a sharp, experienced software engineer with a creative edge, strong problem-solving skills, a solid software development foundation and desire and tenacity to be part of Audibles next generation technology, we want to talk with you. Joining our team provides the unique challenge and opportunity to deliver software that benefits many customers around the world.\n\nThe position requires an engineer with experience architecting, developing and supporting distributed & scalable systems and high-volume transaction applications and services with hands-on coding experience in modern object-oriented language. The ideal candidate should exhibit leadership qualities including excellent judgment and high standards. In addition, the candidate must have the ability to dive deep and remain in touch with business details, drive innovation in the teams, invoke passion in others, think big, and deliver results.\n\nABOUT THE TEAM\n\nCustomer Relationship Management (CRM) team's mission is to develop systems and tools that enable marketers to provide customers multi-touch, personalized and timely messages that enhance the experience of using our services. Customer journey automation and real-time targeting are examples of systems that the team works on. These systems are built using cutting edge technologies and products from AWS like Kinesis, S3, EMR, Elastic Search, etc.\n\nKEY RESPONSIBILITIES\n\n· Design, develop, build and operate scalable software systems and services for e-commerce applications.\n\n· Build and deliver high availability/high reliability software on time.\n\n· Build and deliver secure, scalable, and low-latency services.\n\n· Coordinate with other product teams, business stakeholders and Senior Tech Leadership for integration into Audible products.\n\n· Lead significant technical initiatives involving cross-functional teams.\n\n· Work effectively with other groups within Amazon to deliver Audible services.\n"}, {"company_name": "Catalyst Software", "job_title": "Senior Fullstack Engineer", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1044402&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&ea=1&cs=1_aadcf86d&cb=1598754125955&jobListingId=3623276840", "job_description": "Company Overview\nCatalyst is the world’s most intuitive Customer Success Platform (CSP), and was built by an experienced group of industry leaders. Our software integrates with all of the tools that CS teams are already using to provide one centralized view of customer data. Customer Success Managers can subsequently take the right actions to prevent churn, increase product adoption, and align the entire organization on a unified workflow to manage customers throughout their journey. Catalyst helps organizations turn Customer Success into a company-wide mission.\nPosition Overview\nWe’re looking for a Senior Fullstack Engineer to join the Workflows team and build the tools that Customer Success Managers need to streamline their work and collaborate more effectively. From automating their customer lifecycles, to tracking their large team initiatives and controlling how information is shared between users, you’ll focus on the features that supercharge our users’ process from end to end. As a senior member of the team, you’ll also play a role in defining the conventions, best practices and processes of Engineering at Catalyst. If you’re excited to help change the way companies relate to their customers and are passionate about building a beautiful and intuitive product that wows users, let’s chat!\n\nWhat You’ll Do \n\nWork closely with developers, design and product to build the features that our users use everyday. Partner with Engineering Manager and Product Manager to finalize requirements and project scope\nContribute to defining best practices around quality, observability and scalability\nFoster the development of teammates through mentorship and code reviews\nBuild consensus around solutions that balance solving for our current business cases, future iterations and maintainability\nIdentify performance bottlenecks and advocate for improvements to our evolving backend and frontend infrastructure\n\n\nWhat You’ll Need\n\nExperience working across the full stack of modern web applications and a track record of driving improvements to a legacy codebase\nDeep empathy for the customer experience and pain points, and an insatiable curiosity about product decisions\nExtensive experience in designing and building highly scalable web services with considerations for real time functionality, flux pattern implementation, distributed systems and/or relational database query performance. Deep knowledge of Ruby on Rails and Vue (or other comparable languages and frameworks)\nFamiliarity with common API and services design best practices\nDemonstrated ability to communicate complex technical concepts clearly to teammates and stakeholders, regardless of their experience or technical expertise\nAbility to identify the gaps in a technical solution, product brief or design, while leaving space for different ideas and collaborating with teammates to come to the best solution\nSound judgment when balancing moving quickly with producing quality code and long-term code maintainability\nA love for shipping features that delight customers and enable them to be more effective at their jobs\n\n\nWhy You’ll Love Working Here!\n\nHighly competitive compensation package, including equity - everyone has a stake in our growth\nComprehensive benefits, including 100% paid medical insurance coverage for you, your partner, and your dependents\nUnlimited vacation policy, encouraging you to take the time you need - we trust you to strike the right work/life balance\nPersonal Seamless account, to be used for free daily lunches; catered team lunches twice per week\nAnnual education stipend, to ensure that you're continuously expanding your skill set\nMonthly team-building events (including game nights - Super Smash Brothers, Team Fortress 2, and Codenames, anyone?, trivia, and more!)\n\nCatalyst is an equal opportunity employer, meaning that we do not discriminate based upon race, religion, national origin, gender identity, age, sexual orientation, or any other protected class. We believe that diversity is more than just good intentions, and we are committed to creating an inclusive environment for all employees.\n"}, {"company_name": "Mphasis Limited", "job_title": ".Net Developer - ND01", "company_location": "New York, NY", "apply_link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1044074&s=58&guid=000001743d2bf582899bc5e3eec0ba2c&src=GD_JOB_AD&t=SR&vt=w&cs=1_6fa3377f&cb=1598754125948&jobListingId=3645306702", "job_description": ".NET Developer-\n\nWho are we looking for? .NET developer who can understand the requirements, design and provide the desired output. Should work independently with minimal instructions from the Lead.\n\nTechnical Skills:\n\n.NET, ASP.NET, Javascript, VBScript, Jquery, SQL, Control M, HTML, MVC, web services, web API, SOAP services, REST, AngularJS\n\n\nProcess Skills: -\n\n\n\nExperience in Agile software development methodology and practices with full development lifecycle from inception through implementation.\nWorking knowledge of Object-Oriented Analysis/Object Oriented Design methodologies and life cycles.\nDemonstrated experience with SCM tools such as GIT, Subversion.\nExcellent analytical, communication, organizational and problem-solving skills coupled with a strong work ethic\nAbility to deliver in a fast-paced global team environment.\nTest-infected attitude (strong desire to perform thorough and exhaustive unit, integration and system testing)\n\nBehavioral Skills:\n\nResolve technical issues of projects and Explore alternate designs\nParticipates as a team member and fosters teamwork by inter-group coordination within the modules of the project.\nEffectively collaborates and communicates with the stakeholders and ensure client satisfaction.\nTrain and coach members of project groups to ensure effective knowledge management activity.\n\n\n.Net with Angular JS"}]