[
  {
    "job_title": "Junior Software Engineer",
    "company_name": "Metro Group",
    "company_location": "Long Island City, NY 11101",
    "reviews": "45 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=611147834ac53ea4&from=vj&pos=bottom&sjdu=OpIFG4m1C2hRbY984x67I1jAQYHjQCyGQd9VfXfpnIHHIRxmZUnUcVHFjdFUxDCn&astse=91d797e12153f0df&assa=4472",
    "job_description": "The Metro Group, Inc., is an established, successful, premier Building Service company founded in 1925. Our services include water treatment, boiler repairs, service and installations, HVAC repairs, water services & testing, regulatory compliance and various other valuable building services. We take pride in the work we do while building long lasting partnerships not only with our clients but most importantly with our employees. We are currently seeking a motivated Junior Software Engineer that is looking to establish themselves within a company that values fostering continued career growth. This position will work in Metro Group’s Information Systems Department, implementing solutions by developing and deploying code meant to solve real world business problems. The successful candidate should be a dynamic professional with a “can do attitude” able to adapt and manage a wide range of technical and business responsibilities. Role and Responsibilities (include but not limited to): - Maintain and improve a variety of existing web applications - Develop and deploy quality of life enhancements for proprietary, in-house CRM system (.NET, SQL Server, HTML, CSS, JS) - Automate manual processes to streamline workload for existing staff - Identify potential opportunities for process improvement and report automation using SSRS, external data sources, and other resources - while executing changes to systems with little to no impact - Create ad-hoc SSRS reports as requested in a timely and accurate manner for management (prepare and maintain daily, weekly, monthly, and quarterly reports) - Set and execute personal biweekly JIRA sprints to further IS team goals - Monitor incoming issues and resolve bug tickets in a timely and accurate manner - Help backfill for IT when necessary such as troubleshooting technical issues with printers, servers, and user workstations Qualifications and Requirements: - Bachelor's Degree or equivalent from four-year College or technical school, preferably in Computer Science, Computer Engineering, Information Systems - NET Programming experience (minimum 1 year) - Web Programming experience w/ HTML, CSS, JS (minimum 1 year) - SQL experience (1 year), specific to Microsoft SQL Server (a plus) - Intermediate knowledge of Microsoft Excel, including the ability to create / work with Pivot Tables, VLOOKUP and similar functions. Scripting knowledge in Perl, Python, PHP, Visual Basic and/or Windows batch scripting - VM and/or Cloud Administration experience Preferred Skills (PLUS but NOT required; will TRAIN the right person): - AngularJS knowledge - Macros and VBA proficiency - Node.js knowledge - Express.js knowledge - React knowledge - React Native knowledge - PHP knowledge Benefits and Perks: - Excellent Benefits package including medical and dental insurance - 401K Retirement Plan including company match - Paid holidays, Paid Personal Time Off - Company-paid life insurance - Extensive on the job training provided with career advancement opportunities The Metro Group, Inc. is an EEOC-compliant employer."
  },
  {
    "job_title": "Software Engineer",
    "company_name": "TF Cornerstone",
    "company_location": "New York, NY 10016",
    "reviews": "0 reviews",
    "job_description": "TF Cornerstone has been in the residential, commercial and retail property business for over 50 years, with extensive expertise and unsurpassed success in the New York City area.As a software engineer in the office of the CTO,you will help drive the digital transformation of one of New York’s leading real estate companies. You will work across business units to unlock efficiency, reveal business-critical data and insights, and develop the new technical foundations of the company.Some examples of work we’ve done:· Build a client-side MVC framework in React /Redux to drive all our front-ends· Develop a customized workflow framework to digitize, track, and make efficient work in multiple departments, including accounting, leasing, residential, commercial management· Integrate e-mail, single-sign-on, and building entry systems so employees and guests can enter authorized doors with a touchof a finger or a click of a button· Developed Tableau dashboards from Post gres,backed up by S3 data lake and Apache Airflow data pipeline to integrate internal systems, 3rd party apps, and ERP systemSkills we need:· Proven drive and ability to write clean code,learn on the fly, and staying up-to-date with tech· Ability to navigate legacy code bases;refactoring, applying design patterns, best practices· Multiple projects of experience with LAMP stack or similar technologies· Deep knowledge of web application fundamentals(HTTP, APIs, MVC, HTML / CSS /Javascript)· Experience learning from, teaching, and communicating both with software engineers and non-technical usersPreferred:· 2+ years of experience· Experience with UI / UX, including prototyping,wireframing, eliciting user requirements· Experience with site reliability engineering,telemetry, logging· Bachelor’s degree in Computer Science· Startup experienceJob Type: Full-timePay: $100,000.00 - $110,000.00 per yearBenefits:401(k)401(k) MatchingDental InsuranceDisability InsuranceEmployee Assistance ProgramFlexible ScheduleFlexible Spending AccountHealth InsuranceLife InsurancePaid Time OffParental LeaveReferral ProgramTuition ReimbursementVision InsuranceSchedule:Monday to FridayExperience:relevant: 2 years (Preferred)Education:Bachelor's (Required)Work Location:One locationCompany's website:tfc.comSchedule::Monday to FridayWork Remotely:Temporarily due to COVID-19"
  },
  {
    "job_title": "Software Engineer, Blockchain",
    "company_name": "Affinity Capital Exchange Inc.",
    "company_location": "New York, NY 10005",
    "reviews": "0 reviews",
    "job_description": "Join us as we revolutionize the loyalty economy by bringing the benefits of financial markets to the loyalty industry. We are building the world’s first market venue for issuance and trading of standardized loyalty (frequent flier) points/miles, enabling the creation of financial instruments backed by loyalty point portfolios. Through financial innovation that is supported by tried-and-tested market infrastructure and technology, ACE aims to revolutionize the loyalty economy and unlock more than $1 trillion in value that is currently untapped.About YouYou are a talented Java and/or fullstack developer with experience in enterprise finance solutions, AWS and Blockchain (Hyperledger Fabric is a big plus). You have likely worked in the financial industry (and possibly also in the airline/travel industry), building secure and high performing solutions and have DevOps experience. You will contribute to the design, development and support of a full-fledged financial services system utilizing Blockchain. You will collaborate with a team of engineers, QA, UX and customers to create market leading solutions in a startup environment.ResponsibilitiesDesign and deliver high-quality softwareBuild new enterprise-grade backend featuresMaintain and expand the Blockchain networkEngage with the team and customers to provide ad hoc help and supportTest the software extensively with the teamCollaborate with product, engineering and QA to drive successful product release and adoptionRequirementsYou are passionate about building, observing and operating financial systems in productionExperience with auto-scaling, infrastructure as code, automated monitoring and reportingExperience developing solutions within cloud computing platforms (AWS, Azure etc) and container orchestration systems (e.g. Docker, Kubernetes)4+ years of experience with JavaPerformance analysis and optimizationDesigning and implementing APIsDesired skills & experienceExperience using Hyperledger Fabric or similarConfigured and deployed enterprise solutions in AWSFamiliarity with working in a fast-paced start-up environmentQualificationsBachelor's degree in Computer Science (or related field)4+ years of relevant work experienceExpertise in Java, AWS and BlockchainExperience with Agile and continuous delivery methodologiesAbility to multitask, organize, and prioritize workBenefitsHealth InsurancePaid Time OffCertifications / training paid forFlexible ScheduleAbout ACEBased in New York City (Manhattan), Affinity Capital Exchange (ACE) is a fintech innovator in the loyalty finance space. ACE aims to revolutionize the loyalty economy by bringing the benefits of financial markets to loyalty in a way that respects the unique needs of the industry. Its technology and market platform will provide new solutions to members, initially focusing on generating collateral and attracting liquidity efficiently. We offer competitive salary, benefits, and equity.Job Type: Full-timePay: From $100,000.00 per yearBenefits:Health InsurancePaid Time OffProfessional Development AssistanceSchedule:Monday to FridaySupplemental Pay:Bonus PayExperience:java: 1 year (Preferred)Education:Master's (Preferred)Work authorization:United States (Required)Relocation Assistance Provided:YesVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousPeople-oriented -- enjoys interacting with people and working on group projectsDetail-oriented -- would rather focus on the details of work than the bigger pictureAchievement-oriented -- enjoys taking on challenges, even if they might failAutonomous/Independent -- enjoys working with little directionInnovative -- prefers working in unconventional ways or on tasks that require creativityHigh stress tolerance -- thrives in a high-pressure environmentCompany's website:https://www.afcx.coCompany's Facebook page:https://www.linkedin.com/company/acexchange/Work Remotely:Temporarily due to COVID-19"
  },
  {
    "job_title": "Bioinformatics Software Engineer I",
    "company_name": "Memorial Sloan-Kettering Cancer Center",
    "company_location": "New York, NY 10017",
    "reviews": "1,018 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=57cdd2be4fef57a2&from=vj&pos=bottom&spon=1&adid=357582568&ad=-6NYlbfkN0AfhXZLdKKEaSrE-A3kTViGcJyfCs_ENjKb6b0iXAiczLqB7mSoCRBqdcY7y0LQ3qZwvqE6zWkvaAM1ZS212fwavcuafGycYLnDvdA6vx3SW9Juq4KFOOLpH_DzvkSVF4VScl5PkdDS_q3zECJtfio-0nZhsbzHKD-vtGBdIjMPEn11so0S_mmIP_OkHbIh1yvUT2dWnhkaytyM3oxIhM7tmu1EaZ5_liUzLxhOiwhfHZiB_Dd1qnW6NIWLxcPbjswuoZIyH5X5Vkmf9HqAefx529ra3yDKx5cMr9I2pU5tug%3D%3D&sjdu=eseEraZuFvkYFH5RJn2GabPShISDxNQBsQ0wXdgouPpvJgF3CI0OIHsaTIan1RO48ku6hcmrNPVax6m5G70kZKkbNEFk_ydxcPiHVhw35MK0T8oNQg4Ke_bbvCd9KX6cYqZpZzI9cM2VLrCO7mIF9K7SEajF6jzuDgDz6qEHQ2NCKBru9Xk7xSStaIO8wZFBmD4hrYzJsj4wDkU1kcCuxT47DrtSpjG0jZxXORCW3gS8sK_Bh5APC3Ilattj1sK-bUc6bpqWhtcH6kf8nytiWH7QvJjKzr2kel1uZLm3qJPukyna8misAn4QTm_AuBBgPLNKJHT71fzibwSaHJmZmA&astse=152679f7b783103d&assa=4653",
    "job_description": "Company Overview:\n\nAt Memorial Sloan Kettering (MSK), we’re not only changing the way we treat cancer, but also the way the world thinks about it. By working together and pushing forward with innovation and discovery, we’re driving excellence and improving outcomes.\n\nFor the 30th year, MSK has been named a top hospital for cancer by U.S. News & World Report. We are proud to be on Becker’s Healthcare list as one of the 150 Great Places to Work in Healthcare in 2019, as well as one of Glassdoor’s Employees’ Choice Best Place to Work for 2019. We’re treating cancer, one patient at a time. Join us and make a difference every day.\n\nJob Description:\n\nMSK is seeking a Bioinformatics Software Engineer to join the Computational Oncology Service in the Department of Epidemiology and Biostatistics.\n\nWorking in a team, the Bioinformatics Software Engineer will develop software to support leading edge, large scale research efforts in computational oncology including genomics, imaging and clinical data analysis and interpretation. Motivated by contributing meaningfully to contemporary progress in cancer research driven by advances in computing and data, we are seeking talented, highly skilled engineers with experience developing robust, enterprise level contemporary software systems. We are recruiting developers in three key areas: data analysis workflows in high performance computing systems (including cloud), database engineering, and data visualization. The Bioinformatics Software Engineer will employ software development best practices in a small team-based setting, contributing to software design, implementation, testing, and documentation.\nYou Will:\nWork and collaborate with researchers and software engineers to design, build, and deploy interactive, real-time data visualization dashboards on high volume genomic data using ReactJS and Node.js\nDesign and build databases for the data underlying the data visualizations, writing efficient algorithms to index and query the data, and ensuring the integrity of the data\nEstablish and maintain continuous integration and continuous deployment workflows of databases and dashboards on premise and cloud-based infrastructures\nImplement and follow best practices in software development, code versioning, software testing and deployment\nTake part in technical discussion including but not limited to code reviews and build/release management\nYou Are:\nCapable of building strong customer relationships and delivering customer-centric solutions\nA good decision-maker, with proven success at making timely decisions that keep the organization moving forward\nAble to work effectively in an environment notable for complex, sometimes contradictory information\nConsistently achieving results, even under tough circumstances\nResilient in recovering from setbacks and skilled at finding detours around obstacles\nAble to operate effectively, even when things are not clear or the way forward is not obvious\nAdept at learning quickly, applying insights from past efforts to new situation\nYou Need:\nBachelor’s degree in Computer Science and at least 1 year of related experience\nExperience with one or more of the following: Javascript, Python\nFamiliarity with databases (SQL or NoSQL)\nFamiliarity with git, svn, or another version control system\nExperience with Javascript (ReactJS) and Elasticsearch preferred\n#LI-POST\nClosing:\n\nMSK is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sexual orientation, national origin, age, religion, creed, disability, veteran status or any other factor which cannot lawfully be used as a basis for an employment decision.\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment."
  },
  {
    "job_title": "Software Engineer",
    "company_name": "eBay Inc.",
    "company_location": "New York, NY 10012",
    "reviews": "1,666 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=a9089bde3290e120&from=vj&pos=bottom&spon=1&adid=308389915&ad=-6NYlbfkN0A9TGvvMbs_9tzUmxh-6hF76myvpV3Plf7hsqRV14VZ2cfT-rsmf5GVxwBGvDOrxtruOXbrQn8VXotcvS3EZFYQ6zY_d0cw5p44SE_rzVw6mEVdpLXFodIZFbbQBcgx71lO8llXqK87GyxfrFDS1FZTBIgpiYTpAte-lHAV6BOmSmxTupaTnI4oWf6IZMMZ3XQ3D2AQLergaoPu5nlOtxijQaqVKbDNrT_yIag0W-2xeb6QvaF9Nn2P8xuoUfERHe_2xNiiXx9ybiMsRYJ8rCjKHNxTV97eAY5bAV_SMe8RaQ%3D%3D&sjdu=QWF4TUFyrHvH7u082A4fa2x-MZfx0VM1URzhorpd7Po&astse=003b51e03888713d&assa=4656",
    "job_description": "Like to shake things up? We do. eBay hires innovators who can push boundaries and change the world. Design, develop and implement core software systems or applications. Think globally and help eBay be on the top tier with new products, including cloud-based or internet-related tools.\nWe are looking for a motivated software engineer to build robust and scalable software, help improve our code services and system architecture, participate in brainstorming sessions and supply ideas to our technology, algorithms and products, and work with the product and design teams to understand end-user requirements, formulate use cases, and deliver results. We want the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward. You’ll work alongside the best and the brightest engineering talent in the industry. As a core participant of your team, you’ll estimate engineering efforts, prioritize projects, plan implementations, and triage production issues. You need to be dynamic, collaborative, and curious as we build new experiences, improve existing products, and develop distributed systems powering the world’s largest e-commerce websites at a scale few companies can match.\n\nNote: By applying to this position, your application will be considered for locations we hire for in the United States including, but not limited to: Bay Area, CA; Bellevue, WA; Portland, OR; Boston, MA and New York, NY.\n\nYou are:\nAnalytical. Able to convert abstract concepts into viable products using CS fundamentals\n\nResourceful. Have the ability to do a lot with a little. Be able to aggregate information from various places and build relationships with key partners to get the information you need\n\nData Driven. Able to use data to frame out and solve problems\n\nWe need:\nProgramming expertise. Be proficient at object oriented programming concepts, design patters, and SDLCA technical connoisseur. Be comfortable with algorithms and data structures, such as dynamic array, linked list, stack, queue, binary search, binary search tree, hash map, depth first search, breadth first search, and merge sort.\n\nA go-getter. Seek new opportunities, don’t shy away from challenges, and bring energy and enthusiasm to the office every day.\n\nBasic Qualifications:\nCompleted a Bachelor's, Master’s or PhD Degree in Computer Science or related field\n\nStrong applied experience. You’ve built, broken, and rebuilt software applications\n\nCreative thinker who knows how to create real-world products\n\nKey skills: Java, Python, distributed systems, cloud-related knowledge\nDisclaimer: Please note that by applying to this role, you are agreeing to be considered for multiple positions. This is a general description of the qualifications and skills required for positions of this type of role.\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\nView our privacy policy\nView our accessibility info\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com . We will make every effort to respond to your request for disability assistance as soon as possible.\n\nDisclaimer: Please note that by applying to this role, you are agreeing to be considered for multiple positions. This is a general description of the qualifications and skills required for positions of this type of role.\n\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\n\nView our privacy policy\n\nView our accessibility info\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com . We will make every effort to respond to your request for disability assistance as soon as possible.\n\nFor more information see:\nEEO is the Law Poster\nEEO is the Law Poster Supplement"
  },
  {
    "job_title": "Software Engineer Intern",
    "company_name": "ThriveFantasy",
    "company_location": "New York, NY 10017",
    "reviews": "0 reviews",
    "job_description": "We are looking for a engineering intern for our true startup. We are live on iOS, Android, and Web.Responsibilities:- Ensure the apps and web run smoothly- Wear multiple hats when necessaryRequirements:-Java, HTML, Javascript, CSS, Angular.Pluses:-Java development for Android and Swift development for iOS-Heroku or other cloud hosting services like AWS with S3Job Type: InternshipPay: $15.00 - $20.00 per hourBenefits:Paid Time OffSchedule:Monday to FridayExperience:Software Engineer: 1 year (Preferred)Education:Bachelor's (Required)Work Location:One locationThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedOutcome-oriented -- results-focused with strong performance cultureStable -- traditional, stable, strong processesCompany's website:www.thrivefantasy.comWork Remotely:No"
  },
  {
    "job_title": "Junior Front End / Full Stack Software Engineer",
    "company_name": "Plectica",
    "company_location": "New York, NY",
    "reviews": "0 reviews",
    "job_description": "New York, NY or Remote\nWe are looking for great engineers to join our startup team as we build the next generation of content mapping tools. These are enterprise-strength tools anyone can quickly learn to use to map and track complex thoughts or systems of any kind.\nOur software is underpinned by the state of the art in systems thinking methodology and the pioneering work of our cofounder Dr. Derek Cabrera, an internationally renowned cognitive scientist based at Cornell University.\nSystems Thinking is an increasingly popular method of analysis and problem solving, widely applicable in industry, government, not-for-profit, education, business, and civic sectors. Its real promise lies in visually unpacking complex systems, thereby helping experts develop solutions to seemingly intractable and often transdisciplinary issues, including those which contain competing interests and touch economic, political, social, and other systems.\nOur tech stack includes Riot.js atop SVG for interactive map building and visualization; Redis / Node.js / WebSockets for real-time collaboration; MySQL for a source of truth; and some other tools and services around text-understanding and image processing in Python.\nYou are: a highly-motivated front-end engineer who is excited to learn new things, and help in shaping, building a product, working with a cross-functional group, incorporating user-feedback.\nStrong candidates will have…\nStrong proficiency with modern ES6+ JavaScript\nProficiency with advanced CSS (transforms, animation, filters, flexbox, grid etc)\nExperience with SVG/Canvas, and/or drawing tools like d3.js, Fabric.js, Processing.js, etc\nExperience with application frameworks such as Riot.js / React.js / Vue.js\nFull-stack inclination with some backend experience with Node.js/Python/Ruby\nExperience in an Agile product development environment\nA passion for getting things in front of customers and iterating fast\nTo apply, please send a cover letter and resume to jobs@plectica.com"
  },
  {
    "job_title": "Backend Software Engineer",
    "company_name": "Appfigures, Inc.",
    "company_location": "New York, NY 10002",
    "reviews": "0 reviews",
    "job_description": "Appfigures is a sales and marketing analytics platform for mobile developers. We take the guesswork out of running the business around your apps and we're looking for talented backend developers to help us. You’ll be building new features and improving existing ones used daily by thousands of mobile app developers all around the world. Like every member of the Appfigures team, you'll also be involved in making decisions about product development and user experience.You & Us: You have mastered a programming language of your choice. You are likely sick and tired of writing Fizz Buzz. We mainly use C# and Python, but it’s okay if you don’t know them. We think that being a capable developer in one language implies you’d be able to get comfortable with most languages or environments. We are always open to trying new things to figure out what the best tool for the job is and hope you are too.You have a disciplined approach to development, testing, and quality assurance. We know perfection isn’t possible, but we think about the trade-offs inherent in our designs and guard against them up front. Folks rely on our data to run their businesses, so it’s important that we get it right.You recognize that sometimes you need to throw away the prototype (and sometimes you need to ship it). We think it’s OK to experiment and we understand that sometimes you don’t know if something will work until you try it. And sometimes that thing you tried just didn’t work.You can write clean, fast, and efficient code while keeping in mind the bigger context of what we are doing and why. We wouldn’t do this if it weren’t fun, but we know that at the end of the day the software we build is to simplify the lives of our customers.You’re looking forward to getting to know our users. We rotate escalated support duties across the team. It’s an opportunity for everyone to see how our users interact with the platform, what they need next, and what could be improved.You’re willing to try new things in a collaborative environment. We’re a small team so responsibilities are flexible. We are a place where initiative beyond the job description is rewarded. We want you to feel empowered to commit or critique in any part of our codebase or company. We want you to feel empowered to take features from an idea all the way to our users. We think every team member’s perspective and opinion is important, and taken together will help make the best product we can.Pluses: A BS / MS in Computer Science or related field-- a degree means less to us than proven ability.Contributions to open source projects, blogs, books, and StackOverflow or work experience.Experience with the web, the software and hardware behind it, scraping, and performance analysis.What You Might Be Working OnIntegrating a new datasource or API integration to ingest new datasets mobile app developers need to run their businesses.Scaling a critical scraping service.Diagnosing and fixing performance issues in our API.Working with sales, marketing, and others on the product and engineering teams to envision and create new products and features for our users.Helping the data science team turn ML models into production-grade products.BenefitsGreat medical, dental, and vision insurance401(k) retirement planPre-tax transit benefits, subsidized gym memberships and excellent discounts on hundreds of other well-known services and productsPlenty of paid time-off and flexible remote work policyAwesome work station with whatever you need to be happy and productiveA fully stocked kitchen with a variety of snacks and drinksMonthly personal project daysWeekly catered lunchesEvents for employees and membersHow To ApplyPlease forward a small, self-contained code sample (jobs_backend at appfigures dot com or via indeed messaging). It can be in any language of your choice-- we are more interested in clarity than complexity. A small program you've written or something else you are proud of would be ideal.If you have a portfolio, source repos, hexdump of a demoscene intro that runs on a microwave, or something similar online already you can just point us in that direction.Job Type: Full-timeExperience:Software Development (not including school): 1 year (Preferred)Education:Bachelor's (Preferred)Work authorization:United States (Required)"
  },
  {
    "job_title": "Software Development Engineer I, Mastercard Launch 2021",
    "company_name": "MasterCard",
    "company_location": "New York, NY 10011",
    "reviews": "601 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=0ebae70e31fd173f&from=vj&pos=bottom&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjwjdPvGgaVSiQmr533eq5-VAq81dAHm7GpE1MqdfeWCQ&astse=054f0d23300496f0&assa=5720",
    "job_description": "Our Purpose\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nJob Title\nSoftware Development Engineer I, Mastercard Launch 2021\nMastercard Launch is a full-time graduate development program designed to build the skills we leverage most as an innovator in the payments space, connects employees in enriching ways, and immerses new talent into our Doing Well by Doing Good culture. This program is meant for those who dare to be greater and those who wish to make a real impact in the world.\n\nEligibility requires degree completion of a bachelors or masters degree in December of 2020 or May 2021.\n\n\nMastercard’s software engineering teams leverage Agile development principles, advanced development and design practices, and an obsession over security, reliability, and performance to deliver solutions that delight our customers. As a software development engineer, you’ll develop advanced technologies and applications that are revolutionizing payments.\n\n\n\nAre you passionate about software engineering?\nDo you enjoy seeing the impact your code has on a wide range of customers?\nDo you want to work for a company that offers above and beyond benefits including paid\nparental leave, flexible work hours, gift matching, and even volunteer incentives while\n\nencouraging your own professional learning and development?\n\nDo you thrive in a place where you are continuously learning more while growing your\nskills and career?\n\nDo you want to join a Company that offers a competitive benefits-and rewards program\nthat attracts, develops and retains the most talented employees around the world?\n\nDo you want to join an inclusive culture where employees, in all their diversity, feel valued,\nrespected and who can bring their authentic selves to work? Learn more at Mastercard’s\n\nCorporate Sustainability Report.\n\n\nRole:\n\nHands-on developer who writes high quality, secure code for a small to mid-sized\ncomponent or feature that is modular, functional and testable.\n\nContribute to all parts of the software’s development including design, development,\ndocumentation, and testing.\n\nHave strong ownership of your team’s software and are deep in the maintenance\ncharacteristics, runtime properties and dependencies including hardware, operating\n\nsystem, and build.\n\nCommunicate, collaborate and work effectively in a global environment.\n\nAll About You:\n\nCurrently enrolled in a bachelor’s or master’s degree program majoring in Computer\nScience or a related field with a graduation date of December 2020 or May 2021.\n\nStrong foundation in algorithms, data structures and core computer science concepts.\nEvidence of working with object-oriented development and design patterns.\nProficiency in one or more modern programming languages such as Java, Python, C++\nStrong written and verbal English communications skills.\nStrong analytical and excellent problem-solving skills.\nExperience working in an Agile environment.\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.\nMastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law.\nIf you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly."
  },
  {
    "job_title": "Junior Programmer",
    "company_name": "Midtown Comics, Inc.",
    "company_location": "New Hyde Park, NY 11040",
    "reviews": "0 reviews",
    "job_description": "JUNIOR PROGRAMMER WANTED AT MIDTOWN COMICS’ WAREHOUSE IN NEW HYDE PARK, LONG ISLAND!Enter the fabulous world of comics and work for the premiere retailer. In addition to your natural born love of comics, the following are the job duties.Job Duties:Provide support to the design, development, implementation, and maintenance of Midtown Comics software.Effectively self-test programming, diagnose problems, and debugging code.Logging and tracking processes from scheduling to completion.Creating procedure documentation for processes.Develop a schedule for project completion and meet deadlines as assigned.Other duties as assigned.Qualifications:Must have at least two years of programming experience.Bachelor’s degree in Computer Science or equivalent.Working knowledge of VB.Net and SQL Server.Working knowledge of Web Programming.Ability to communicate effectively with; team members, and management in both written and verbal form.Good analytical and problem-solving abilities.Scheduled hours: Monday through Friday - 8:30 AM – 4:30 PMJob Type: Full-timePay: $55,000.00 per yearBenefits:Employee DiscountHealth InsurancePaid Time OffSchedule:Monday to FridayExperience:Programming: 2 years (Preferred)Education:Bachelor's (Preferred)Location:New Hyde Park, NY 11040 (Required)Work authorization:United States (Required)Work Location:One locationBenefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:No"
  },
  {
    "job_title": "Software Development Engineer II",
    "company_name": "Discovery",
    "company_location": "New York, NY 10022",
    "reviews": "0 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=a1e5c4050d05b4f0&from=vj&pos=bottom&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjC8LSq6KHukMf6RP8IgUWdwsdLqiuaGy5Gw05HfKNzLw&astse=eafec1ab09715b88&assa=6245",
    "job_description": "Discovery hires the very best and brightest talent who are enthusiastic and passionate to fulfill the company’s mission of empowering people to explore their world and satisfy their curiosity.\nIn exchange for their talent and drive, employees are provided with an engaging, diverse workplace and the resources they need to learn, thrive and grow in their careers.\nPosition Summary\nAd Delivery, Targeting and Monitoring is a global platform team focused on providing product engineering teams with capabilities to deliver and measure targeted ads within their digital video streaming products. We monitor KPIs and use data driven decision making to continuously improve upon the customer experience.\nAs television and media habits change, our mission remains true to the principles that founded Discovery – every day we seek to ignite people’s curiosity to engage, entertain and enlighten the world around them through amazing viewing experiences.\nThe Direct to Consumer Group is a technology company within the Discovery brand.\nWe are building a global streaming video platform (OTT), and a suite of applications to support all our network’s brands globally. We are building modern container-based microservices operated on AWS. Our platform covers everything from search, catalogue, video transcoding, personalization, to global subscriptions, and much more. We build user experiences ranging from classic lean-back viewing to interactive learning applications. We build for connected TVs, web, mobile phones, tablets, and consoles for a large footprint of Discovery owned networks. (Discovery, Food Network, Golf TV, MotorTrend, Eurosport, Discovery Play, and many more) This is a growing, global engineering group crucial to Discovery’s future.\nWe are hiring software development engineers to join our team in New York City. The ideal candidate has a track record of shipping high quality features in industry software engineering roles. You have solved business problems with simple and straightforward solutions, applied appropriate technologies and software engineering best practices, delivered high-quality results the first time and improved code, documentation, and results with each iteration. Your existing team trusts your work.\nResponsibilities\n1. You are able to work autonomously to design and develop functional changes to existing software systems. You require little or no guidance by team members. You still actively seek input where appropriate and engage your team to inform and share what you are doing.\n2. You can collaborate with other engineers assisting on features another engineer designed or taking the lead on feature design yourself. Your software contributions are demonstrated to work in production, and your team trusts your decisions, designs, and code.\n3. You are able to describe and defend your design and code decisions to other engineers, embrace constructive feedback, and adapt your approach to align with team and company standards and objectives.\n4. You consistently demonstrated good software ownership practices (e.g. code reviews, code comments, etc.) in all your contributions. Your code reviews are uneventful, you prepare documentation proactively, and you ensure proper monitoring for operational excellence in production.\n5. You offer enhancements to best practices, document, design and architecture improvements, and as feedback through code reviews to other engineers without continuous prompting or recurring encouragement. Other engineers appreciate your feedback.\n6. You can troubleshoot a production issue by reviewing source code, logs, operational metrics, stack trace etc. to pinpoint a specific problem and then resolve it.\nRequirements\n3+ years of experience developing server-side web applicationsExperience with software engineering best practices (e.g., unit testing, design patterns, building maintainable code, performance)Experience with both relational and non-relational databaseExperience with implementing software in at least one modern programming language such as PHP, Python, GoLang or JavaKnowledgeable with REST API design, implementation and documentationKnowledgeable with 3rd party API consumption, both client- and server-sideMust have the legal right to work in the United States\n\nDiscovery Communications, Inc. is an equal opportunity employer. Discovery is committed to being an employer of choice, not just a good place to work, but a great and inclusive place to work. To that end, we strive to recruit and maintain a workforce that meaningfully represents the diverse and culturally rich communities that we serve. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disabled status or, genetic information.\nWe will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including but not limited to all local Fair Chance Ordinances.\nEEO is the Law\nPay Transparency Policy Statement\nCalifornia Job Applicant Privacy Policy\nIf you are an individual with a disability and need an accommodation during the application process, please send an email request to HR@discovery.com."
  },
  {
    "job_title": "Software Engineer, Platform",
    "company_name": "Peloton",
    "company_location": "New York, NY",
    "reviews": "106 reviews",
    "job_description": "The Test Infrastructure team develops and maintains high quality automated testing platforms across Engineering. As a Software Engineer on the Test Infrastructure team, you'll help drive the technical direction for the tools and testing patterns essential for our engineering teams across disciplines and across the stack, and be an evangelist for best testing practices. You will evaluate technical tradeoffs and push for the best user experience to confidently test & release application code multiple times a day.\n\nThe Role:\n\nWork collaboratively on architectural changes to significantly scale our applications, both internal and end-user facing, for the long term\nDesign the process and tools needed for teams across engineering disciplines to confidently test splitting our monolithic codebase into services\nBuild and improve libraries and tooling in areas such as Performance Testing, Functional Testing, Contract Testing, Regression Testing, and Data Anonymization pipelines\nActively develop and maintain services to orchestrate our Load Testing infrastructure\nEvangelize best practices in performance and scalability engineering, participate in architecture design reviews\n\nCandidate Requirements:\n\nSolid understanding of request processing, caching, queuing, data storage, partitioning, and replication\nProficient in at least one programming language e.g. Python, Kotlin, Java, Scala\nExperience with tools we use including Kubernetes, ArgoCD, Docker, Jenkins, Gatling, Pact, AWS\nSelf directed and detail oriented with the ability to come up with thorough analysis of production issues and design proposals\nB.S. in Computer Science or equivalent years of work experience\n\nABOUT PELOTON\n\nPeloton is the largest interactive fitness platform in the world with a loyal community of more than 2.6 million Members. The company pioneered connected, technology-enabled fitness, and the streaming of immersive, instructor-led boutique classes for its Members anytime, anywhere. Peloton makes fitness entertaining, approachable, effective, and convenient, while fostering social connections that encourage its Members to be the best versions of themselves. An innovator at the nexus of fitness, technology, and media, Peloton has reinvented the fitness industry by developing a first-of-its-kind subscription platform that seamlessly combines the best equipment, proprietary networked software, and world-class streaming digital fitness and wellness content, creating a product that its Members love. The brand's immersive content is accessible through the Peloton Bike, Peloton Tread, and Peloton App, which allows access to a full slate of fitness classes across disciplines, on any iOS or Android device, Fire TV, Roku, Chromecast and Android TV. Founded in 2012 and headquartered in New York City, Peloton has a growing number of retail showrooms across the US, UK, Canada and Germany. For more information, visit www.onepeloton.com."
  },
  {
    "job_title": "Software Engineer - University Graduate",
    "company_name": "PayPal",
    "company_location": "New York, NY 10014",
    "reviews": "1,360 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=71340de1ea450fc3&from=vj&pos=bottom&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgQqZCh_Ebnzgs-p8Ew5rXDULY8luZ3vf8Ryj3D5QnPXg&astse=1c87003ec5b48512&assa=6649",
    "job_description": "Software Engineers at PayPal develop innovative solutions and high-quality products that touch millions of people every day around the globe. Our engineers solve some of the most complex technical problems in the world of connected payments across all business units, including PayPal, Braintree, Venmo, Paydiant and others. We are looking for the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward with respect to functionality, performance, reliability, and scalability.\nYou’ll work alongside the best and the brightest engineering talent in the industry. We have opportunities in a wide range of areas including development, design, search, platform, test, quality, big data, front end and back end. As a core participant of your team, you’ll estimate engineering efforts, design your changes, implement and test your changes, push to live, and triage production issues. You need to be dynamic, collaborative, and curious as we build new experiences, improve existing products, and develop distributed systems powering the world’s largest e-commerce and payments websites at a scale only a few companies can match.\nKey Responsibilities:\nCode high-volume and scalable software\nCreate web applications using React/Node and other technologies\nCreate back end services using Java, SQL, ReST\nBuild and develop new user facing experiences\nPartner closely with cross functional teams in design, product and other business units\n Basic Requirements:\nGraduated within the past 12 months, or will be graduating by Spring 2021, with a Bachelor’s or Master’s degree in Computer Science or related field from an accredited college or university\nStrong applied experience. You’ve built, broken, and rebuilt software applications. We’re looking for creative thinkers who also know how to create real-world products.\nWorking knowledge of web technologies (such as HTTP, HTML/DOM, JavaScript, CSS, AJAX) will be beneficial\nFamiliarity with Node.js applications\nFamiliarity with Java, C++ and/or Python\nUnderstanding around concepts like Web Services, SOA, REST APIs\nA constant desire to grow, learn, and explore new things\nPosition Location: Varies\nJob_Description_Summary: At PayPal, we’re literally reinventing how the world pays and gets paid. We understand that it’s about people. We connect individuals to let them shop, get paid, donate and send money using today’s technology with the confidence that comes from the security and control PayPal enables. Are you ready to help us change the world? The world’s leading payments company, PayPal, brings together a family of brands that are revolutionizing the way people move money. At PayPal you will be immersed in an amazing community with a vibrant culture that thrives on innovation, collaboration, inclusion and wellness.\nWho we are: Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 286 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.\nWe're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.\nPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities."
  },
  {
    "job_title": "2020 Software Engineer Intern",
    "company_name": "Bloomberg",
    "company_location": "New York, NY",
    "reviews": "812 reviews",
    "apply_link": "https://www.indeed.com/rc/clk?jk=02de239c0c5c6f24&from=vj&pos=bottom&spon=1&adid=316695709&ad=-6NYlbfkN0Ab67y_gTDH9tSaT0HLOcX4Q3W4UsL2WfVRyJV-qqww-V4IRDL3wY_Uj3G0Z9WcuCadEl1sqFYiGHxheFGi79fT1AeZHRsCDrroYiWd3Ts3ruE2gW5zBb77CRWufdNq3Ib0cGZKfgICigsJAoPUzM3sNrs-W45acmQmvn1vpZX2pfAyr7p9RvewB4Cl-VSfp3ONpx5F1PdzlnSFwjb3LwHeLASka1sCgoSmhNQudQwmai8wiCCBeuy0XSvanuxxBaGFIP0qxk8w1nnYan1VoLtOC8dBn2eEhrYsqSthrWObfgih2LhVNjNJ&sjdu=9BT7mm534fdS0Ti7TQERuvmDuy0LQ48c-yDmKDRxc9s-moDml7Y3RI9r_QuOLJ910n3OBqMqtFYhNlV1l9XTtUoAhNN-RQNO9DCQmiH16_4ws3gSh1s4KHw0oP4pjYbU18DQwcovm8MnrOtPHduG7f5XUZD0Yxc2jwglHCYZGQ0wDdEMHx2MsdnCYlyew7rtbQz9zQ3ceuyehy2VjrmqPufH_PBbc7B2i8IBFVOQ6F1qr4hOy45OpaiGS1WGO4wGQBnRfxYu0gCWIvKWPtgo1fPzircls3pLpjoyV2g8SiCxt6__MaarZYQeBCfs0Z_SNDZv0iXfX1kgLDBUip1yGw&astse=12a85fcaaf8dc027&assa=6678",
    "job_description": "Bloomberg software engineers develop impactful solutions to complex, real-world problems. This is no different for our interns. Engineering interns take ownership of their projects under the mentorship of full-time software engineers. We are looking for top computer science students who are passionate about technology and eager to learn in our high energy, fast-paced environment.\n\nAs an intern, you'll become an expert on the Bloomberg Terminal and gain a deeper understanding of technology and finance. In addition to your projects, you'll participate in coding challenges, attend tech talks and network with other interns.\n\nWe'll trust you to:\nTake ownership of projects under the guidance of your mentor\nBe a collaborative member of your team\nHave a deep understanding of data structures and algorithms\nBe an excellent problem solver\nYou'll need to:\nHave programming experience in C, C++, Java or Python\nHave a minimum GPA of 3.0\nBe working toward a BA, BS, MS or PhD in Computer Science\nIf this sounds like you, please apply below!"
  },
  {
    "job_title": "Python Developer",
    "company_name": "Systemonex INC",
    "company_location": "New York, NY",
    "reviews": "0 reviews",
    "job_description": "Job SummarySystemoneX is An IT Service Company, which has clients across the USA . The company with relevant services and trustworthy efforts. An E-Verified company with an object of advancement and innovation in the IT industry. Systemonex Inc maintains the standard as suitable scientific techniques and surveys. Our vision is to provide a transformed internet technology for the advance and creative efforts with smart working. We are continuously striving for preparing the base for modern innovative technology. The company has outstanding resources and assistance to provide the best services to its clients. Our existence support many business and companies to grow their market. Our customers have gained the best solution and techniques for development through our updated consulting advice.Responsibilities and DutiesResponsibilities**Regular activities involve independent tasks on BI/Infra and DevOps, also coordinate with the off-shore team to share and receive the activities/task updatesRobust design to implement ETL pipeline with hands-on coding skills in Python, Py-spark in AWS cloud to handle change data captureWork with multiple third-party vendors/customer teams like source team, Infra team, Security team, IT teams, and off-shore team, etc.,Customer-facing role with expertise in all AWS/Cloud infrastructure activities as listed below:Analyze various third-party tools like Masking tools: DataGuise/DataVant, AWS Tools and scheduling toolsImplement POCs as per customer requirementOnce POC is accepted and responsible for the installation of tools in AWS cloud platformIndividual capability to setup application installation in EC2 instances, EMR clustersResponsible for environments (Dev/TEST/Prod) setup which includes IAM/policies, Network enabling, etc.,Interact with Source teams whenever needed and accordingly plan the downstream activitiesResponsible for Sprint planning and Identifying the priorities by discussing with the customer and other teams like Source/Infra and SecurityExpertise to review coding/design and data validations developed by the off-shore team and other stakeholders, including 3rd party tool/service vendorsImplement solutions/task as per customer requirement then and there and guide the off-shore teamMandatory experience in handling CI/CD pipelines and expertise in Dev-Ops for stack/infra deployments to CloudHandling deployments to the higher environment by using CI/CD pipelinesRequirements-Familiarity with two of the following Python libraries: Sci-kit, Pandas, Numpy, Matplotlib, and PyTorchExperience with AWS-based applicationsWorking knowledge of data visualization techniquesSQL proficientKnowledge and adaptation of software configuration, change, release and service management processesExperience in working with cross-functional application and business teamsAbility to perform root cause analysis, problem management, and performance tuningRequired Experience and QualificationsBachelor's DegreeJob Types: Full-time, Temporary, Internship, Contract, CommissionPay: $35.00 - $45.00 per hourExperience:Python: 1 year (Preferred)Education:Bachelor's (Required)Work authorization:United States (Preferred)Required travel:100% (Preferred)Full Time Opportunity:YesCommission Only:NoWork Location:One locationBenefits:Health insuranceOtherEmployment Length:VariesThis Company Describes Its Culture as:Innovative -- innovative and risk-takingAggressive -- competitive and growth-orientedPeople-oriented -- supportive and fairness-focusedTeam-oriented -- cooperative and collaborativeOutcome-oriented -- results-focused with strong performance cultureThis Job Is:Open to applicants under 18 years old, provided it is legally allowed for the job and locationA good fit for applicants with gaps in their resume, or who have been out of the workforce for the past 6 months or moreA job for which all ages, including older job seekers, are encouraged to applyOpen to applicants who do not have a college diplomaSchedule:Monday to FridayOther"
  }
]
